export const defendedDissertationsCh = [
  {
    "name": "ЧЕКИН О.Н.",
    "title": "Исследование деформированного состояния натурных конструкций методом измерения кривизн",
    "details": "Защита 28.12.76. Дисс. к.т.н. / Ин-т механики АН УССР. – Киев, 1976. – 188 с."
  },
  {
    "name": "ЧЕРВИНКО Ольга Петровна",
    "title": "Установившиеся колебания и разогрев прямоугольной призмы и короткого цилиндра из вязкоупругих материалов",
    "details": "Защита 11.11.86. Дисс. к.ф.-м.н. 01.02.04 / Ин-т механики АН УССР. – Киев, 1986. – 181 с."
  },
  {
    "name": "ЧЕРЕВКО К.И.",
    "title": "Дифракция антисимметричных волн в многосвязных пластинах",
    "details": "Защита 05.11.74. Дисс. к.ф.-м.н. / Ин-т механики АН УССР. – Киев, 1974. – 171 с."
  },
  {
    "name": "ЧЕРЕПИНА Марина Валентиновна.",
    "title": "Нелинейное деформирование осесимметричных цилиндрических при нестационарных нагрузках",
    "details": "Защита 1992 г. Дисс. к.т.н. / Ин-т механики НАН Украины. – Киев, 1992. – 180 с."
  },
  {
    "name": "ЧЕРИНЬКО Павел Николаевич",
    "title": "Динамическая устойчивость ортотропных прямоугольных пластин и оболочек вращения переменной жесткости",
    "details": "Защита 19.03.85. Дисс. к.ф.-м.н. 01.02.04 / Ин-т механики АН УССР. – Киев, 1984. – 115 с."
  },
  {
    "name": "ЧЕРНЕЦКАЯ Лариса Николаевна",
    "title": "Обобщенный вход и оценки устойчивости движений неавтономных многомассовых систем",
    "details": "Защита 17.07.86. Дисс. к.ф.-м.н. 01.02.01 / Ин-т механики АН УССР. – Киев, 1986. – 147 с."
  },
  {
    "name": "Чернобай Володимир Сергійович.",
    "title": "Напружений стан та ефективні пружні властивості кусково-однорідних тіл з неідеальними еліптичними границями розділу за антиплоского зсуву. : к.ф.-м.н. : спец.. 01.02.04 - Механіка деформівного твердого тіла : дата захисту 2018-12-18; . Інститут надтвердих матерiалiв iм. В.М. Бакуля НАН України. – , 0418U004314.",
    "details": ""
  },
  {
    "name": "ЧЕРНООЧЕНКО Андрей Анатольевич",
    "title": "Ультразвуковой неразрушающий метод определения упругих свойств и напряженно-деформированного состояния поверхностных слоев материалов и элементов конструкций",
    "details": "Защита 25.06.91. Дисс. к.ф.-м.н. 01.02.04 / Ин-т электросварки АН УССР. – Киев, 1991. – 150 с."
  },
  {
    "name": "ЧЕРНОПИСКИЙ Дмитрий Игнатьевич",
    "title": "Исследование напряженного состояния упругихъ толстостенных гофрированных оболочек",
    "details": "Защита 24.06.80. Дисс. к.ф.-м.н. / Ин-т механики АН УССР. – Киев, 1980. – 218 с."
  },
  {
    "name": "ЧЕРНЫШЕНКО Иван Семенович",
    "title": "Осесимметричное упруго-пластическое состояние оболочек вращения при конечных прогибах",
    "details": "Защита 23.05.67. Дисс. к.т.н. / Ин-т механики АН УССР. – Киев, 1966. – 239 с."
  },
  {
    "name": "ЧЕРНЫШЕНКО Иван Семенович",
    "title": "Упруго-пластическое состояние тонких оболочек, ослабленных отверстиями",
    "details": "Защита 10.02.81. Дисс. д.т.н. 01.02.04 / Ин-т механики АН УССР. – Киев, 1980. – 328 с."
  },
  {
    "name": "ЧЕХОВ Валерий Николаевич",
    "title": "Развитие аналитических исследований напряженно-деформированного состояния пологих и непологих оболочек, ослабленных отверстиями",
    "details": "Защита 25.11.86. Дисс. д.ф.-м.н. 01.02.04 / Ин-т механики АН УССР. – Киев, 1986. – 300 с."
  },
  {
    "name": "ЧЕХОВ Виктор Николаевич",
    "title": "Исследование распределения напряжений в круговой цилиндрической оболочке с конечным числом немалых отверстий",
    "details": "Защита 20.10.70. Дисс. к.ф.-м.н. / Ин-т механики АН УССР. – Киев, 1970. – 167 с."
  },
  {
    "name": "ЧЕХОВ Виктор Николаевич",
    "title": "Трехмерные задачи устойчивости слоистых полуограниченных тел",
    "details": "Защита 17.06.86. Дисс. д.ф.-м.н. 01.02.04 / Ин-т механики АН УССР. – Киев, 1985. – 291 с."
  },
  {
    "name": "ЧИГИРИНСКИЙ А.В.",
    "title": "Выбор оптимальной структуры стеклопластика в упругих тонких оболочках вращения",
    "details": "Защита 16.04.68. Дисс. к.т.н. / Ин-т механики АН УССР. – Киев, 1967. – 112 с."
  },
  {
    "name": "ЧОРНОІВАН Юрій Олексійович",
    "title": "Плоскі змішані задачі лінійної теорії в’язкопружності та механіки руйнування ортотропних тіл",
    "details": "Захист 28.10.2003 р. Дис. к.ф.-м.н. 01.02.04 / Ін-т механіки ім. С.П.Тимошенка НАН України. – Київ, 2003. – 126 с."
  },
  {
    "name": "ЧУДНОВСКИЙ В.Г.",
    "title": "Колебания и устойчивость стержневых систем",
    "details": "Защита 03.02.51. Дисс. д.т.н. / Ин-т строительной механики АН УССР. – Киев, 1951. – 612 с.+ 68 с. чертежей."
  },
  {
    "name": "ЧУПАХА Людмила Дмитриевна",
    "title": "Решение задач о напряженном состоянии ортотропных толстостенных цилиндрических оболочек при неоднородных граничных условиях",
    "details": "Защита 24.09.85. Дисс. к.ф.-м.н. 01.02.04 / Ин-т механики АН УССР. – Киев, 1985. – 139 с."
  }
] as const;
