export const defendedDissertationsV = [
  {
    "name": "Вайнберт Д.В.",
    "title": "Развитие методов теории упругости применительно к расчету частей машин и сооружений, обобщенная бигармоническая задача для составных тел",
    "details": "Защита 02.02.90. Дисс. д.т.н. / Ин-т строительной механики АН УССР. – Киев, 1990. – 505 с."
  },
  {
    "name": "ВАЛЕЕВА Ирина Кимовна",
    "title": "Оптимальное управление ориентацией системы твёрдых тел в центральном поле",
    "details": "Защита 1993 г. Дисс. к.ф.-м.н. 01.02.01 / КГТУ строительства и архитектуры. – Киев, 1993. – 166 с."
  },
  {
    "name": "ВАН Фо Фы Г.А.",
    "title": "Приложение функций Матье и дельта-функции к исследованию пластин и оболочек",
    "details": "Защита 22.12.59. Дисс. к.т.н. / Ин-т строительной механики АН УССР. – Киев, 1959. – 157 с."
  },
  {
    "name": "ВАН Фо Фы Г.А.",
    "title": "Основы теории полимерных тел с ориентированной структурой",
    "details": "Защита 04.01.66. Дисс. д.т.н. / Ин-т механики АН УССР. – Киев, 1965. – 235 с."
  },
  {
    "name": "ВАРВАК А.П.",
    "title": "Устойчивость цилиндрических оболочек с заполнителем",
    "details": "Защита 24.09.68. Дисс. к.т.н. / Ин-т механики АН УССР. – Киев, 1968. – 140 с."
  },
  {
    "name": "ВАРВАК П.М.",
    "title": "Исследование пластинок методом решеток",
    "details": "Защита 30.06.48. Дисс. д.т.н. / Ин-т строительной механики АН УССР. – Киев, 1948. – 397 с."
  },
  {
    "name": "ВАСИЛЕНКО А.Т.",
    "title": "Напряженное состояние изотропных и анизотропных оболочек вращения при антисимметричном нагружении",
    "details": "Защита 07.05.48. Дисс. к.ф.-м.н. / Ин-т механики АН УССР. – Киев, 1967. – 180 с."
  },
  {
    "name": "Ваиленко А.Т.",
    "title": "Напряженное состояние анизотропных оболочек многослойной структуры с переменными параметрами",
    "details": "Защита 05.12.78. Дисс. д.ф.-м.н. 01.02.04 / Ин-т механики АН УССР. – Киев, 1978. – 446 с."
  },
  {
    "name": "ВАСИЛЕНКО Н.В.",
    "title": "Нелинейно-гистерезисная задача механики деформируемого тела",
    "details": "Защита 02.10.73. Дисс. д.т.н. / Киевский политехнический ин-т МВ и ССО УССР. – Киев, 1973. – 327 с."
  },
  {
    "name": "ВАСИЛЬЕВ Александр Борисович",
    "title": "Оптимальные встречи материальных точек в силовом поле при прохождении траекторий вблизи притягивающего центра",
    "details": "Защита 31.10.89. Дисс. к.ф.-м.н. 01.02.01 / Ин-т механики АН УССР. – Киев, 1988. – 185 с."
  },
  {
    "name": "ВАСИЛЬЄВ Ігор Юрійович",
    "title": "Проблеми оптимізації довготривалих пілотованих космічних польотів",
    "details": "Захист 30.12.98. Дис. к.ф.-м.н. 01.02.01 / Ін-т механіки НАН України, КДУ ім. Т. Шевченка. – Київ, 1998. – 157 с."
  },
  {
    "name": "ВАСИЛЬЄВА Лариса Яківна",
    "title": "Зв'язані термомеханічні процеси і структурні перетворення в фізично нелінійних циліндричних тілах при осесиметричному імпульсному термічному навантаженні",
    "details": "Захист 25.09.12. Дис. к.ф.-м.н. / Ін-т механіки НАН України. – Київ, 2012. – 146 с."
  },
  {
    "name": "ВАСИЛЬЕВА Анна Леонидовна",
    "title": "Хаотизация колебаний нелинейных механических систем через последовательность бифуркаций",
    "details": "Защита 18.12.90. Дисс. к.ф.-м.н. 01.02.01 / Киевский инженерно-строительный ин-т. – Киев, 1990. – 210 с."
  },
  {
    "name": "ВЕРБИЦКИЙ Владимир Григорьевич",
    "title": "Структура и оценки областей притяжения динамических систем, моделирующих колесные экипажи",
    "details": "Защита 22.05.84. Дисс. к.ф.-м.н. 01.02.01 / Ин-т механики АН УССР. – Киев, 1984. – 150 с."
  },
  {
    "name": "ВЕРБИЦКИЙ Владимир Григорьевич",
    "title": "Нелинейная устойчивость многозвенных систем с качением, дивергентные бифуркации и катастрофы стационарных состояний",
    "details": "Защита 29.12.98. Дисс. д.ф.-м.н. 01.02.01 / Ін-т механіки НАН України. – Киев, 1998. – 252 с."
  },
  {
    "name": "ВЛАЙКОВ Г.Г.",
    "title": "Напряженное состояние толстостенных ортотропных оболочек вращения",
    "details": "Защита 25.01.77. Дисс. к.т.н. / Ин-т механики АН УССР. – Киев, 1976. – 172 с."
  },
  {
    "name": "ВОВКОДАВ Оксана Василівна",
    "title": "Розв'язання задач про напружено-деформований стан сферичних оболонок змінної жорсткості в уточненій постановці на основі сплайн-апроксимації",
    "details": "Захист 27.05.14. Дис. к.ф.-м.н. 01.02.04 / Ін-т механіки ім. С.П. Тимошенка НАН України. – Київ, 2014. – 127 с."
  },
  {
    "name": "ВОЛК С.И.",
    "title": "Метод расчета оболочек вращения с меридиональными ребрами, учитывающий циклический симметричный характер деформации",
    "details": "Защита 24.09.68. Дисс. к.т.н. / Ин-т механики АН УССР. – Киев, 1968. – 158 с."
  },
  {
    "name": "ВОЛОГЖАНИНОВ Юрий Николаевич",
    "title": "Приближенные методы разделения напряжений в экспериментальной механике",
    "details": "Защита 11.11.84. Дисс. д.ф.-м.н. 01.02.04 / Ин-т механики АН УССР. – Киев, 1984. – 301 с."
  },
  {
    "name": "ВОРОБЬЕВ В.М.",
    "title": "Некоторые нелинейные задачи динамики гироскопических систем",
    "details": "Защита 31.01.78. Дисс. к.ф.-м.н. / Ин-т механики АН УССР. – Киев, 1977. – 204 с."
  },
  {
    "name": "ВОРОБЬЕВ Сергей Анатольевич",
    "title": "Динамика некруговых цилиндрических оболочек в жидкости",
    "details": "Защита 27.12.83. Дисс. к.ф.-м.н. / Ин-т механики АН УССР. – Киев, 1983. – 119 с."
  },
  {
    "name": "ВОСТРОВ Евгений Николаевич",
    "title": "Исследование закономерностей неизотермического циклического деформирования материалов при высоких температурах",
    "details": "Защита 27.09.83. Дис. к.т.н. 01.02.04 / Ин-т механики АН УССР. – Киев, 1983. – 205 с."
  }
] as const;
