export const defendedDissertationsR = [
  {
    "name": "РАДЗИЕВСКИЙ В.А",
    "title": "Электродинамический виброметр и его применение для исследования колебаний",
    "details": "Защита 12.03.57. Дисс. к.т.н. / Ин-т строительной механики АН УССР. – Киев, 1956. – 186 с."
  },
  {
    "name": "РАМСКАЯ Екатерина Ильинична",
    "title": "Гармонические колебания и волны в анизотропных полых цилиндре и шаре",
    "details": "Защита 28.01.86. Дисс. к.ф.-м.н. 01.02.04 / Ин-т механики АН УССР. – Киев, 1985. – 112 с."
  },
  {
    "name": "РАМСЬКИЙ Андрій Олександрович",
    "title": "Осесиметричні задачі теорії пружності для багатошарових плит з початковими напруженнями",
    "details": "Захист 1996 р. Дис. к.ф.-м.н. 05.05.07 / Хмельницький державний ун-т Міністерства освіти і науки України. – Хмельницький, 1996. – 135 с."
  },
  {
    "name": "РАТУШНЯК Тетяна Володимировна",
    "title": "Поширення магнітопружних хвиль зсуву в регулярно-шаруватих магнітострикційних середовищах",
    "details": "Захист 04.07.2006 р. Дис. к.ф.-м.н. 01.02.04 / Ін-т механіки ім. С.П.Тимошенка НАН України. – Київ, 2006. – 135 с."
  },
  {
    "name": "РВАЧЕВ Михаил Алексеевич",
    "title": "Построение статически возможных полей напряжений для численного решения задач упруго-вязко-пластического деформирования твердых тел",
    "details": "Защита 24.09.91. Дисс. д.ф.-м.н. 01.02.04 / Винницкий политехнический ин-т. – Винница, 1991. – 406 с."
  },
  {
    "name": "РЕВУЦКИЙ Владимир Николаевич",
    "title": "Собственные колебания ребристых сферических оболочек с присоединенными массами",
    "details": "Защита 02.04.85. Дисс. к.т.н. 01.02.03 / Ин-т механики АН УССР.– Киев, 1984. – 152 с."
  },
  {
    "name": "РЕШЕТАРЬ Анатолий Дмитриевич",
    "title": "Колебания пологих сферических оболочек с учетом начальных несовершенств и геометрической нелинейности",
    "details": "Защита 29.11.88. Дисс. к.ф.-м.н. 01.02.04 / Ин-т механики АН УССР. – Киев, 1988. – 165 с."
  },
  {
    "name": "РОВЕНКО Юрій Вікторович",
    "title": "Коливання і дисипативний розігрів в’язкопружних тіл при полігармонічному деформуванні, викликаному рухом поверхневих навантажень",
    "details": "Захист 04.02.2003 р. Дис. к.ф.-м.н. 01.02.04 / Ін-т механіки ім. С.П.Тимошенка НАН України. – Київ, 2002. – 151 с."
  },
  {
    "name": "РОЖОК Лилия Степановна",
    "title": "Определение напряженого состяния некруговых полых неоднороджных цилиндров на основе аппроксимациии функций дискретными рядами Фурье",
    "details": "Защита 10.06.2003 г. Дисс. к.ф.-м.н. 01.02.04 / Ин-т механики им. С.П.Тимошенко НАН Украины. – Киев, 2003. – 168 с."
  },
  {
    "name": "Рожок Лілія Степанівна",
    "title": "Просторові задачі теорії пружності для циліндричних оболонок складної геометрії та структури : д.ф.-м.н. : спец.. 01.02.04 - Механіка деформівного твердого тіла : дата захисту 2019-09-24; . Інститут механіки ім. С.П. Тимошенка НАНУ. – , 0519U001169",
    "details": ""
  },
  {
    "name": "РОМАНОВ Александр Вениаминович",
    "title": "Нелинейная модель накопления повреждений и расчет долговечности в условиях ползучести при нестационарном нагружении",
    "details": "Защита 26.09.89. Дисс. к.т.н. 01.02.04 / Ин-т механики АН УССР.– Киев, 1989. – 169 с."
  },
  {
    "name": "РОМАНЦОВ Константин Владимирович",
    "title": "Напряженное состояние ортотропных пластин и панелей, ослабленных отверстием с двумя радиальными трещинами",
    "details": "Защита 29.09.92. Дисс. к.ф.-м.н. 01.02.04 / Ин-т механики НАН Украины. – Киев, 1992. – 81 с."
  },
  {
    "name": "РУБАЧ ОМ",
    "title": "Растяжение и изгиб круглых пластин, усиленных радиальными ребрами",
    "details": "Защита 29.12.53. Дисс. к.т.н. / Ин-т строительной механики АН УССР. – Киев, 1953. – 129 с."
  },
  {
    "name": "РУБЕЖАНСКИЙ Юрий Иванович",
    "title": "Оптимальное управление напряженно-деформированным состоянием цилиндрических и пологих оболочек с помощью локализованных нагрузок",
    "details": "Защита 30.11.82. Дисс. к.ф.-м.н. 01.02.04 / Ин-т механики АН УССР. – Киев, 1982. – 117 с."
  },
  {
    "name": "РУБЦОВА Ирина Габидуловна",
    "title": "Высокочастотные изгибные колебания упругих призматических тел",
    "details": "Защита 21.05.85. Дисс. к.ф.-м.н. 01.02.04 / Ин-т механики АН УССР. – Киев, 1985. – 125 с."
  },
  {
    "name": "РУБЦОВ Юрий Константинович",
    "title": "Исследование распространения нестационарных упругих волн от полостей на основе метода геометрической оптики",
    "details": "Защита 09.11.82. Дисс. к.ф.-м.н. 01.02.04 / Ин-т механики АН УССР. – Киев, 1982. – 159 с."
  },
  {
    "name": "РУДНИЦКИЙ Вячеслав Брониславович",
    "title": "Контактное взаимодействие упругих штампов с предварительно напряженными телами",
    "details": "Защита 14.06.88. Дисс. д.т.н. 01.02.04 / Ин-т механики АН УССР. – Киев, 1988. – 361 с."
  },
  {
    "name": "РУДНИЦКИЙ Сергей Иванович",
    "title": "Развитие и анализ уточненой теории колебаний пьезокерамических оболочек",
    "details": "Защита 24.02.87. Дисс. к.ф.-м.н. 01.02.04 / Ин-т механики АН УССР. – Киев, 1986. – 102 с."
  },
  {
    "name": "РУСІНОВ Олександр Олександрович",
    "title": "Довготривале руйнування тонкостінних циліндричних труб за умов повзучості при двовісному статичному навантаженні",
    "details": "Захист 25.012.2004 р. Дис. к.т.н. 01.02.04 / Ін-т механіки ім. С.П.Тимошенка НАН України. – Київ, 2004. – 152 с."
  },
  {
    "name": "РУЩИЦКИЙ Ярема Ярославович",
    "title": "Исследование основных задач механики смеси упругих сред",
    "details": "Защита 08.06.82. Дисс. д.ф.-м.н. 01.02.04 / Ин-т механики АН УССР. – Киев, 1982. – 342 с."
  }
] as const;
