export const defendedDissertationsU = [
  {
    "name": "УКРАИНСКИЙ Л.Е.",
    "title": "Вибрационная устойчивость твердых частиц, взвешенных в жидкостях и газах",
    "details": "Защита 24.06.75. Дисс. к.ф.-м.н. / Ин-т механики АН УССР. – Киев, 1975. – 141 с."
  },
  {
    "name": "УЛИТКО А.Ф.",
    "title": "Метод собственных векторных функций в пространственных задачах теории упругости",
    "details": "Защита 01.06.71. Дисс. д.ф.-м.н. / Ин-т механики АН УССР. – Киев, 1971. – 493 с."
  }
] as const;
