export const defendedDissertationsN = [
  {
    "name": "НАЗАРЕНКО Владимир Михайлович",
    "title": "Задачи механики разрушения материалов при сжатии вдоль взаимодействующих трещин",
    "details": "Защита 25.10.88. Дисс. д.т.н. 01.02.04 / Ин-т механики АН УССР. – Киев, 1988. – 338 с."
  },
  {
    "name": "НАЗАРЕНКО Лидия Валентиновна",
    "title": "Термоупругость стохастических композитов с анизотропными компонентами",
    "details": "Защита 1990 г. Дисс. к.ф.-м.н. / Ин-т механики АН УССР. – Киев, 1990. – 175 с."
  },
  {
    "name": "НАЗАРЕНКО Лидия Валентиновна",
    "title": "Модели связанного деформирования и повреждаемости анизотропных композитных материалов стохастической структуры",
    "details": "Защита 29.09.2009 г. Дисс. д.ф.-м.н. / Ин-т механики им. С.П.Тимошенко НАН Украины. – Киев, 2009. – 318 с."
  },
  {
    "name": "НЕМИШ Ю.Н.",
    "title": "Плоская задача моментной теории упругости для областей с отвертием",
    "details": "Защита 21.03.67. Дисс. к.ф.-м.н. / Ин-т механики АН УССР. – Киев, 1966. – 159 с."
  },
  {
    "name": "НЕМИШ Ю.Н.",
    "title": "Пространственные задачи теории упругости для неканонических областей",
    "details": "Защита 10.06.79. Дисс. д.ф.-м.н. 01.02.04 / Ин-т механики АН УССР. – Киев, 1978. – 389 с."
  },
  {
    "name": "НИКИТИНА Нелли Владимировна",
    "title": "Динамика неголономных систем Чаплыгина при освобождении от некоторых связей в процессе движения",
    "details": "Защита 22.02.77. Дисс. к.ф.-м.н. / Ин-т механики АН УССР. – Киев, 1976. – 117 с."
  },
  {
    "name": "НИКИТИНА Нелли Владимировна",
    "title": "Анализ регулярности и квазихаотичности колебаний нелинейных механических систем",
    "details": "Защита 30.05.2000 г. Дисс. д.ф.-м.н. 01.02.01 / Ин-т механики им. С.П.Тимошенко НАН Украины. – Киев, 2000. – 318 с."
  },
  {
    "name": "НИКИТИН Сергей Константинович Нестационарное взаимодействие упругих тел.",
    "title": "вращения с частично заполняющей их жидкостью",
    "details": "Защита 07.06.88. Дисс. д.т.н. 01.02.04 / Ин-т механики АН УССР. – Киев, 1988. – 439 с."
  },
  {
    "name": "НИКОЛАЕВ Борис Константинович",
    "title": "Неосесимметричная деформация гибких сферических оболочек переменной жесткости в классической и утонченной постановках",
    "details": "Защита 28.06.88. Дисс. к.ф.-м.н. 01.02.04 / Ин-т механики АН УССР. – Киев, 1988. – 154 с."
  },
  {
    "name": "НИКУЛИНСКАЯ С.Н.",
    "title": "Вопросы качественного анализа потери устойчивости цилиндрическими оболочками",
    "details": "Защита 05.11.69. Дисс. к.ф.-м.н. / Ин-т механики АН УССР. – Киев, 1969. – 143 с."
  },
  {
    "name": "НОВИКОВ В.Д.",
    "title": "Продольные колебания упругой нити, увлекаемой брошенным телом",
    "details": "Защита 30.06.70. Дисс. к.ф.-м.н. / Ин-т механики АН УССР. – Киев, 1970. – 132 с."
  },
  {
    "name": "НОРАЛИЕВ Нурилла Хайдаралиевич",
    "title": "Распределение напряжений около двух равных и неравных отверстий в анизотропных оболочках",
    "details": "Защита 25.06.91. Дисс. к.ф.-м.н. 01.02.04 / Ин-т механики АН УССР. – Киев, 1979. – 132 с."
  },
  {
    "name": "НОСАЧЕНКО А.М.",
    "title": "Исследование влияния ребер, присоединенных масс и вырезов на колебания цилиндрических и слабоконических оболочек",
    "details": "Защита 16.10.79. Дисс. к.т.н. 01.02.04 / Ин-т механики АН УССР. – Киев, 1979. – 132 с."
  },
  {
    "name": "НУДНЫЙ И.П.",
    "title": "Напряженное состояние в податливих креплениях горных выработок с учетом реологических свойств массива",
    "details": "Защита 31.03.70. Дисс. к.т.н. / Ин-т механики АН УССР. – Киев, 1969. – 89 с."
  }
] as const;
