export const defendedDissertationsA = [
  {
    "name": "АБДУГАНИЕВ Абдувакил Абдуганиевич",
    "title": "Разработка микроструктурной теории пористых сред, насыщенных жидкостью, и анализ распространения волн",
    "details": "Защита 27.02.90. – Дисс. к.ф.-м.н. 01.02.04 / Ин-т механики АН УССР. – Ташкент, 1990. – 149 с."
  },
  {
    "name": "АВРАМЕНКО Людмила Григорьевна",
    "title": "Определение ориентации твердого тела",
    "details": "Защита 30.05.89. – Дисс. к.ф.-м.н. 01.02.01 / Ин-т механики АН УССР. – Киев, 1988. – 106 с."
  },
  {
    "name": "АВРАМЕНКО Ольга Александровна",
    "title": "Решение двумерных задач статики конических оболочек в уточненной постановке на основе сплайн-аппроксимций",
    "details": "Защита 2009 г. Дисс. к.ф.-м.н. 01.02.04 / Ин-т механики им. С.П. Тимошенка НАН Украины. – Киев, 2009. – 181 с."
  },
  {
    "name": "АВРАМЕНКО Юлия Александровна",
    "title": "Определение напряженно-деформированного состояния ортотропных тороидальных оболочек переменной толщины в уточненной постановке",
    "details": "Защита 27.05.2014 г. – Дисс. к.ф.-м.н. 01.02.04. – Киев, 2014. – 149 с."
  },
  {
    "name": "АЗИМОВ Рахимжан Каримович",
    "title": "Анализ устойчивости стохастических систем на основе матриц-функций Ляпунова",
    "details": "Защита 1993 г. Дисс. к.ф.-м.н. 01.02.01 / Ин-т механики АН Украины. – Киев, 1993. – 149 с."
  },
  {
    "name": "АКБАРОВ Сурхай Джаббар оглы",
    "title": "Исследование устойчивости двух волокон в упругой матрице",
    "details": "Защита 1981 г. Дисс. к.ф.-м.н. 01.02.04 / Ин-т математики и механики АН Азер. ССР. – Баку, 1981. – 179 с."
  },
  {
    "name": "АКБАРОВ Сурхай Джаббар оглы",
    "title": "Напряженно-деформированное состояне в композитных материалах с искривленными структурами (модель кусочно-однородного материала)",
    "details": "Защита 29.11.88. Дисс. д.т.н. 01.02.04 / Ин-т механики АН УССР. – Киев, 1988. – 473 с."
  },
  {
    "name": "АЛЕКСЕЕВА М.К.",
    "title": "Напряженно-деформированное состояние гибких пластин и оболочек при различных реологических зависимостях в видах нагружения",
    "details": "Защита 28.06.77. – Дисс. к.ф.-м.н. / Ин-т механики АН УССР. – Киев, 1977. – 174 с."
  },
  {
    "name": "АЛТУХОВ Евгений Викторович",
    "title": "Термоупругие задачи для толстых многосвязных плит",
    "details": "Защита 20.06.2006 г. Дисс. к.ф.-м.н. 01.02.04. / Ин-т прикладной математики и механики АН УССР. – Донецк, 1981. – 114 с."
  },
  {
    "name": "АМИРО И.Я.",
    "title": "Расчет пространственных рамных каркасов с учетом работы плит междуэтажных перекрытий",
    "details": "Защита 03.02.1951. Дисс. к.т.н. / Ин-т строительной механики АН УССР. – Киев, 1950. – 142 с."
  },
  {
    "name": "АНДРУШКО Наталія Федорівна",
    "title": "Зв'язані термомеханічні задачі для циліндра із фізично нелінійного непружного матеріалу при осесиметричному нестаціонарному навантаженні",
    "details": "Захист 20.06.2006 г. Дис. к.ф.-м.н. 01.02.04 / Ін-т механіки ім. С.П.Тимошенка НАН України. – Київ, 2006. – 135 с."
  },
  {
    "name": "АНИКЬЕВ И.И.",
    "title": "Экпериментальное исследование вазаимодействия конструкций с ударными волнами",
    "details": "Защита 16.10.79. Дисс. к.т.н. 01.02.04 / Ин-т механики АН УССР. – Киев, 1979. – 112 c."
  },
  {
    "name": "АНИСИМОВА В.Б.",
    "title": "Некоторие задачи устойчивости криволинейных стержней, подкрепляющих цилиндрические оболочки",
    "details": "Защита 03.02.1951. Дисс. к.т.н. / Ин-т строительной механики АН УССР. – Киев, 1951. – 128 с."
  },
  {
    "name": "АНКЯНЕЦ Елена Казимировна",
    "title": "Влияние способа прикрепления дискретных ребер на колебания подкрепленных круговых цилиндрических оболочек",
    "details": "Защита 25.09.2007 г. – Дисс. к.т.н. 01.02.04.– Киев, 2007. – 125 с."
  },
  {
    "name": "АРНАУТА Наталія Володимирівна",
    "title": "Осеиметричні нестаціонарні задачі теорії багатошарових підкріплених оболонов обертання з врахуванням дискретності розміщення ребер",
    "details": "Захист 29.03.2005 г. Дис. к.ф.-м.н. 01.02.04 / Ін-т механіки ім. С.П.Тимошенка НАН України.. – Київ, 2005. – 150 с."
  },
  {
    "name": "АХАЛАЯ Тенгиз Георгиевич",
    "title": "Численное решение задач о неосесимметричной деформации гибких круглых пластин переменной толщины",
    "details": "Защита 23.06.1981 г. Дисс. к.ф.-м.н. 01.02.04 / Ін-т механіки АН УССР. – Киев, 1981. – 135 с."
  },
  {
    "name": "АХМЕДОВ Абдухамид",
    "title": "Движние твердого тела переменной массы на упругих амортизаторах при гармонических воздействиях",
    "details": "Защита 23.02.93. Дисс. к.ф.-м.н. 01.02.01 / Ин-т механики АН Украины. – Киев, 1992. – 174 с."
  }
] as const;
