export const defendedDissertationsK = [
  {
    "name": "КАБИШ Юрій Михайлович",
    "title": "Дослідження задач пружності двохкомпонентних стохастичних композитів на основі статичної моделі неоднорідного деформування",
    "details": "Захист 28.09.2004 р. Дис. к.ф.-м.н. 01.02.04 / Ін-т механіки ім. С.П.Тимошенка НАН України. – Київ, 2004. – 133 с."
  },
  {
    "name": "КАМИНСКИЙ А.А.",
    "title": "Определение критических загрузок для областей, ослабленных криволинейными отверстиями с трещинами",
    "details": "Защита 15.12.1964 г. Дисс. к.ф.-м.н. / Ин-т механики АН УССР. – Киев, 1964. – 102 с."
  },
  {
    "name": "КАМИНСКИЙ А.А.",
    "title": "Разрушение и долговечность упругих и вязко-упругих тел с трещинами",
    "details": "Защита 25.04.78. Дисс. д.ф.-м.н. / Ин-т механики АН УССР.– Киев, 1977.– 217 с."
  },
  {
    "name": "КАРИМЖАНОВ Абдулазиз",
    "title": "Развитие второго метода Ляпунова при исследовании устойчивости неустановившихся движений на основе вспомогательных систем",
    "details": "Защита 29.10.85. Дисс. к.ф.-м.н. 01.02.01 / Ин-т механики АН УССР. – Киев, 1985. – 130 с."
  },
  {
    "name": "КАРЛАШ Валерий Леонидович",
    "title": "Исследование установившихся колебаний тонких пластин и оболочек из пьезокерамики",
    "details": "Защита 19.10.76. Дисс. к.ф.-м.н. / Ин-т механики АН УССР. – Киев, 1976. – 199 с."
  },
  {
    "name": "КАРЛАШ Валерій Леонідович",
    "title": "Експериментально-теоретичний аналіз електромеханічних резонансних коливань і ефективності перетворення енергії в п’єзокерамічних тонкостінних елементах конструкцій",
    "details": "Захист 28.09.2004 р. Дис. д.ф.-м.н. 01.02.04 / Ін-т механіки ім. С.П.Тимошенка НАН України. – Київ, 2004. – 354 с."
  },
  {
    "name": "КАРНАУХОВ Василий Гаврилович",
    "title": "Колебания и устойчивость конических оболочек",
    "details": "Защита 16.06.1964 г. Дисс. к.ф.-м.н. / Ин-т механики АН УССР. – Киев, 1964. – 181 с."
  },
  {
    "name": "КАРНАУХОВ Василий Гаврилович",
    "title": "Связанные квазистатические и динамические задачи термовязкоупругости",
    "details": "Защита 1980 г. Дисс. д.ф.-м.н. 01.02.04 / Ин-т механики АН УССР. – Киев, 1980. – 466 с."
  },
  {
    "name": "КАРПОВА О.А.",
    "title": "К теории анизотропных двухслойных цилиндрических оболочек",
    "details": "Защита 06.01.1970 г. Дисс. к.ф.-м.н. / Ин-т механики АН УССР. – Киев,1968. – 184 с."
  },
  {
    "name": "КАРТАШОВ Геннадий Григорьевич",
    "title": "Свободные колебания слоистых анизотропных пластин и незамкнутих оболочек из композитных материалов",
    "details": "Защита 07.09.85. Дисс. к.т.н. / Куйбышевский авиационный ин-т им. акад. С.П.Королева. – Куйбышев, 1985. – 209 с."
  },
  {
    "name": "КАРШИЕВ Абдували Беркинович",
    "title": "Нестационарное взаимодействие пологих ребристих сферических оболочек с жидкостью",
    "details": "Защита 1990 г. Дисс. к.ф.-м.н. 01.02.04 / Ин-т механики АН Украины. – Киев, 1990. – 117 с."
  },
  {
    "name": "КАЧАЕНКО Ольга Борисовна",
    "title": "Колебания и электроакустическая чувствительность пьезокерамических цилиндрических оболочек в жидкости",
    "details": "Защита 10.12.91. Дисс. к.ф.-м.н. 01.02.04 / Ин-т механики АН Украины. – Киев, 1991. – 112 с."
  },
  {
    "name": "КАШТАЛЯН Мария Юрьевна",
    "title": "Трехмерное напряженно-деформированное состояние неоднородных и анизотропных пластин переменной толщины",
    "details": "Защита 27.10.92. Дисс. к.ф.-м.н. 01.02.04 / Ин-т механики НАН Украины. – Киев, 1992. – 147 с."
  },
  {
    "name": "КАЮК Я.Ф.",
    "title": "Концентрация напряженого состояния возле гибких двусвязных пластин в послекритической стадии",
    "details": "Защита 23.04.1963 г. Дисс. к.ф.-м.н. / Ин-т механики АН УССР. – Киев, 1962. – 127 с."
  },
  {
    "name": "КАЮК Я.Ф.",
    "title": "Некоторые геометрически нелинейные задачи теории пластин, оболочек и методы их решения",
    "details": "Защита 27.05.75. Дисс. д.ф.-м.н. / Ин-т механики АН УССР. – Киев, 1975. – 270 с."
  },
  {
    "name": "КЕДИК Тарас Васильевич",
    "title": "Применение метода сравнения для исследования устойчивости гибридных систем",
    "details": "Защита 17.12.91. Дисс. к.ф.-м.н. 01.02.01 / Ин-т механики АН Украины. – Киев, 1991.– 159 с."
  },
  {
    "name": "КЕКУХ Сергей Александрович",
    "title": "Докритический рост трещин в линенйных вязкоупругих композиционнных матеріалах с различной анизотропией при длительном действии постоянной нагрузки",
    "details": "Защита 26.12.89. Дисс. к.т.н. 01.02.04 / Ин-т механики АН УССР. – Киев,1989. – 205 с."
  },
  {
    "name": "КЕПЕНАЧ Наталія Павлівна",
    "title": "Динаміка підкріплених циліндричних оболонок еліптичного перерізу при нестаціонарних навантаженнях",
    "details": "Захист 27.10.2015 р. Дис. д.ф.-м.н. 01.02.04 / Ін-т механіки ім. С.П.Тимошенка НАН України. – Київ, 2015. – 133 с."
  },
  {
    "name": "КИЛЬЧИНСКАЯ Г.А.",
    "title": "Исследование динамических процессов в цилиндрических оболочках, находящихся в нестационарном температурном поле",
    "details": "Защита 07.05.1963 г. Дисс. к.ф.-м.н. / Ин-т механики АН УССР. – Киев, 1962. – 97 с."
  },
  {
    "name": "КИЛЬЧИНСКИЙ А.А.",
    "title": "Исследование напряженого и деформированного состояния стеклопластиковых оболочек с учетом реономных свойств",
    "details": "Защита 14.01.69. Дис. к.ф.-м.н. / Ин-т механики АН УССР. – Киев, 1968. – 211 с."
  },
  {
    "name": "КИРИЛЮК Віталій Семенович",
    "title": "Тривимірні змішані задачі статики термоелектропружності для півпростору",
    "details": "Захист 24.12.2012 р. Дис. д.ф.-м.н. 01.02.04 / Ін-т механіки ім. С.П.Тимошенка НАН України. – Київ, 2011. – 331 с."
  },
  {
    "name": "КИРИЧОК И.Ф.",
    "title": "Динамика тонких упругих оболочек и пластинок с начальними деформациями",
    "details": "Защита 30.11.1994 г. Дис. к.ф.-м.н. / Ин-т механики АН УССР. – Киев, 1971. – 181 с."
  },
  {
    "name": "КИСЕЛЬ И.М.",
    "title": "Косой продольный изгиб за пределами упругости",
    "details": "Защита 27.06.1946 г. Дисс. к.т.н. / Ин-т строительной механики АН УССР. – Киев, 1946. – 287 с."
  },
  {
    "name": "КЛИМЕНКО Наталия Ивановна",
    "title": "Напряженное состояние неоднородных анизотропных цилиндров при действии центробежных нагрузок",
    "details": "Защита 27.02.2001 г. Дисс. к.ф.-м.н. / Ин-т механики им. С.П.Тимошенко НАН Украины. – Киев, 2000. – 152 с."
  },
  {
    "name": "КЛЮЧНИКОВА В.Г.",
    "title": "Исследование колебаний толстых плит в неклассической постановке",
    "details": "Защита 13.06.67. Дисс. к.ф.-м.н. / Ин-т механики АН УССР.– Киев, 1966.– 143 с."
  },
  {
    "name": "КЛЮЧНИКОВ Юрий Валентинович",
    "title": "Пространственные статистические задачи механики хрупкого разрушения материалов с начальными напряжениями",
    "details": "Защита 29.10.85. Дисс. к.ф.-м.н. / Ин-т механики АН УССР. – Киев, 1985. – 132 с."
  },
  {
    "name": "КЛЯВЛИН В.В.",
    "title": "Исследование зависимости макроскопических характеристик и внутреннего поля напряжений от вида микроструктуры армированнных материалов",
    "details": "Защита 1970 г. Дис. к.т.н. / Ин-т механики АН УССР. – Киев, 1969. – 230 с."
  },
  {
    "name": "КНЮХ Виктор Иванович",
    "title": "Задачи механіки разрушения материалов при сжатии вдоль двух параллельных трещин",
    "details": "Защита 26.11.85. Дис. к.ф.-м.н. / Ин-т механики АН УССР. – Киев, 1985. – 122 с."
  },
  {
    "name": "КОБЗАРЬ Юрий Михайлович",
    "title": "Напряженное и термонапряженное состояние упругих трансверсально-изотропных тел с гиперболоидальными выточками",
    "details": "Защита 24.09.91. Дисс. к.ф.-м.н. 01.02.04 / Ин-т механики АН УССР. – Киев, 1991. – 148 с."
  },
  {
    "name": "КОВАЛЕНКО Анатолий Петрович",
    "title": "Динамика систем «оболочка вращения – жидкость» при переходных процесах движения",
    "details": "Защита 25.04.82. Дисс. к.ф.-м.н. 01.02.01 / Ин-т механики АН УССР. – Киев, 1982. – 135 с."
  },
  {
    "name": "КОВАЛЬЧУК Виктория Валентиновна",
    "title": "Дивергентные и флаттерные бифуркации в фазовых пространствах систем с качением",
    "details": "Защита 25.12.95. Дисс. к.ф.-м.н. 01.02.01 / Ин-т механики АН УССР. – Киев, 1995. – 160 с."
  },
  {
    "name": "КОВАЛЬЧУК Н.В.",
    "title": "Напряженно-деформированное состояние и устойчивость цилиндрических оболочек с більшими прямоугольными отверстиями",
    "details": "Защита 08.05.79. Дисс. к.ф.-м.н. 01.02.03 / Ин-т механики АН УССР. – Киев, 1979. – 160 с."
  },
  {
    "name": "КОВАЛЬЧУК П.С.",
    "title": "Взаимодействие механизмов генерирования колебаний в одной колебательной системе",
    "details": "Защита 29.02.72. Дисс. к.ф.-м.н. / Ин-т механики АН УССР. – Киев, 1971. – 175 с."
  },
  {
    "name": "КОВТУН А.В.",
    "title": "Колебания цилиндрических оболочек с жидкостью в поле случайных сил",
    "details": "Защита 28.03.72. Дисс. к.ф.-м.н. / Ин-т механики АН УССР. – Киев, 1971. – 136 с."
  },
  {
    "name": "КОЖУХОВСКИЙ Николай Николаевич",
    "title": "Метод функций Ляпунова в задачах нелокального анализа нелинейных систем с первыми интегралами",
    "details": "Защита 84.04.24. Дисс. к.ф.-м.н. / Ин-т механики АН УССР. – Киев, 1984. – 120 с."
  },
  {
    "name": "КОЗЛОВ В.И.",
    "title": "Тепловой удар на поверхностях упругих и вязко-упругиї єлементов конструкций",
    "details": "Защита 16. 01.73. Дисс. к.ф.-м.н. / Ин-т механики АН УССР. – Киев, 1972. – 162 с."
  },
  {
    "name": "КОЗЛОВ Владимир Ильич",
    "title": "Двумерніе связанніе динамические задачи термоэлектровязкоупругости при гармоническом деформировании",
    "details": "Защита 1994 г. Дисс. д.т.н. 01.02.04 / Ин-т механики НАН Украины. – Киев, 1994. – 374 с."
  },
  {
    "name": "КОЗЛОВ Сергей Васильевич",
    "title": "Колебания слоистой цилиндрической оболочки с присоединенными массами",
    "details": "Защита 1982 г. Дис. к.ф.-м.н. / Ин-т механики АН УССР. – Киев, 1982. – 161 с."
  },
  {
    "name": "КОКОШИН Станислав Семенович",
    "title": "Исследование напряженного состояния слоистых анизотропных оболочек на основе модифицированных схем МКЭ",
    "details": "Защита 1982 г. Дисс. к.ф.-м.н. 01.02.04 / Ин-т механики АН УССР. – Киев, 1982. – 151 с."
  },
  {
    "name": "КОЛГАДИН В.А.",
    "title": "Упруго-пластические деформации элементов тонкостенных контрукций при сложном сопротивлении",
    "details": "Защита 07.08.64. Дисс. к.т.н. / Институт механики АН УССР. – Киев,1964. – 180 с."
  },
  {
    "name": "КОЛЕНЧУК К.И.",
    "title": "Влияние изменений влажности на прочность элементов конструкций",
    "details": "Защита 20.11.48. Дисс. д.т.н. / Ин-т строительной механики АН УССР. – Киев, 1948. – 278 с."
  },
  {
    "name": "КОЛОДНИЦКИЙ Василий Николаевич",
    "title": "Термонапряженное состояние и термостойкость цилиндрических и призматических образцов из хрупких материалов в условиях резких теплосмен",
    "details": "Защита 26.03.96. ДиСс. к.ф.-м.н. 01.02.04 / Ин-т сверхтвердых материалов НАН Украины. – Киев, 1996. – 175 c."
  },
  {
    "name": "КОМИССАРОВА Г.Л.",
    "title": "Устойчивость продольно-гофрированых цилиндрических оболочек, неподкрепленных и подкрепленных шпангоутами",
    "details": "Защита 11.06.63. Дисс. к.т.н. / Ин-т механики АН УССР. – Киев,1963. – 165 с."
  },
  {
    "name": "КОНОВАЛЕНКО Владимир Владимирович",
    "title": "Исследование напряженно-деформированного состояния около круговых вырезов в цилиндрических оболочках из композитных материалов",
    "details": "Защита 30.12.86. Дисс. к.т.н. 01.02.03 / Ин-т механики АН УССР. – Киев, 1986. – 142 с."
  },
  {
    "name": "КОНОНЕНКО В.О.",
    "title": "Машины для испытания металлов на усталость основанные на применении вразающегося магнитного поля",
    "details": "Защита 28.06.49. Дисс. к.т.н. / Ин-т строительной механики АН УССР. – Киев, 1949. – 126 с."
  },
  {
    "name": "КОНОНЕНКО В.О.",
    "title": "Автоколебания в механических системах, обусловленные трением",
    "details": "Защита 02.02.54. Дисс. д.т.н. / Ин-т строительной механики АН УССР. – Киев, 1953. – 278 с."
  },
  {
    "name": "КОНСТАНТИНОВ А.Х.",
    "title": "Статика и динамика конических оболочек в неклассической постановке",
    "details": "Защита 25.01.66. Дисс. к.ф.-м.н. / Ин-т механики АН УССР.– Киев,1965. – 134 с."
  },
  {
    "name": "КОНТУН Светлана Степановна",
    "title": "Локальные динамические эффекты при контактном взаиодействии упругих тел",
    "details": "Защита 09.09.86. Дисс. к.ф.-м.н. 01.02.04 / Ин-т механики АН УССР. – Киев, 1986. – 173 с."
  },
  {
    "name": "КОРЖ Виталий Павлович",
    "title": "Устойчивость слоистых тел при дейстии поверхностных распределенных нагрузок",
    "details": "Защита 03.10.89. Дисс. к.ф.-м.н. 01.02.04 / Ин-т механики АН УССР. – Киев, 1989. – 153 с."
  },
  {
    "name": "КОРНУХОВ Н.В.",
    "title": "Устойчивость и устойчивая прочность стержневых систем",
    "details": "Защита 03.05.48. Дисс. д.т.н. / И-т строительной механики АН УССР. – Киев, 1947. – 801 с."
  },
  {
    "name": "КОРОЛЕВИЧ Ю.С.",
    "title": "Асимптотическое решение для конической оболочки линейно переменной толщины и приложение его к расчету элементов машин",
    "details": "Защита 20.10.59. Дисс. к.т.н. / Ин-т строительной механики АН УССР. – Киев, 1959. – 189 с."
  },
  {
    "name": "КОСОЛАПОВ В.И.",
    "title": "Второй метод Ляпунова в задаче об устойчивости нелинейных систем о интегрируемым приближением",
    "details": "Защита 13.11.79. Дисс. к.ф.-м.н. / Ин-т механики АН УССР. – Киев, 1979. – 104 с."
  },
  {
    "name": "КОСТЮК З.Д.",
    "title": "Исследование напряженного состояния лопаток турбовоздуходувок по моментной теории оболочек",
    "details": "Защита 19.11.53. Дисс. к.т.н. / Ин-т строительной механики АН УССР. – Киев, 1953. – 128 с."
  },
  {
    "name": "КОХАНЕНКО Н.В.",
    "title": "Определение напряженно-деформированного состояния горной выработки в призабойной зоне",
    "details": "Защита 20.03.79. Дисс. к.ф.-м.н. 01.02.04 / Ин-т механики АН УССР. – Киев, 1978. – 122 с."
  },
  {
    "name": "КОЧНЕВ Геннадий Прокопьевич",
    "title": "Электроупругие осесимметричные колебания пьезокерамических трансформатров",
    "details": "Защита 26.02.91. Дисс. к.ф.-м.н. 01.02.04 / Ин-т механики УССР. – Киев, 1990. – 125 с."
  },
  {
    "name": "КОШЕВОЙ Иван Кириллович",
    "title": "Исследование устойчивости слоистых материалов на основе обобщенной сдвиговой модели",
    "details": "Защита 26.02.85. Дисс. к.ф.-м.н. 01.02.04 / Ин-т механики АН УССР. – Киев, 1984. – 148 с."
  },
  {
    "name": "КОШМАН Владимир Петрович",
    "title": "Исследование диинамических процессов в упругом полупространстве с начальными деформациями при нестрационарном нагружении",
    "details": "Защита 06.09.83. Дисс. к.ф.-м.н. 01.02.04 / Ин-т механики АН УССР. – Киев, 1983. – 147 с."
  },
  {
    "name": "КРАПИВНЫЙ Юрий Николаевич",
    "title": "Способы построения матриц-функций Ляпунова и оценка области асимптотической устойчивости крупномасштабных систем",
    "details": "Защита 14.11.88. Дис. к.ф.-м.н. 01.02.01 / Ин-т механики АН УССР. – Киев, 1988. – 177 с."
  },
  {
    "name": "КРАСНОПОЛЬСКАЯ Т.С.",
    "title": "Резонансные явления в упругих системах с ограниченным возбуждением",
    "details": "Защита 28.06.77. Дисс. к.ф.-м.н. / Государственный ун-т Мин. высш. и сред. спец. образ. УССР. – Киев,1977. – 181 с."
  },
  {
    "name": "КРИВОБЛОЦЬКА Лариа Миколаївна",
    "title": "Нелінійний згин плластини з отвором",
    "details": "Захист 31.01.06. Дис. к.ф.-м.н. 01.02.04 / Ін-т механіки ім. С.П. Тимошенка НАН України. – Київ, 2005. – 154 с."
  },
  {
    "name": "КРИВОРУЧКО Леонард Дмитриевич",
    "title": "Исследование напряженно-деформированного состояния оболочек вращения со случайными термоупругими харакатеристиками",
    "details": "Защита 29.04.80. Дисс. к.ф.-м.н. 01.02.04 / Ин-т механики АН УССР. – Киев, 1980. – 107 с."
  },
  {
    "name": "КРИЖАНОВСКАЯ Татьяна Васильевна",
    "title": "Напряженное состояние гибких анизотропных оболочек вращения при осесимметричном деформировании",
    "details": "Защита 27.09.88. Дисс. к.ф.-м.н. 01.02.04 / Ин-т механики АН УССР. – Киев, 1988. – 177 с."
  },
  {
    "name": "КРИЦУК А.А.",
    "title": "Влияние наклона волокон на длительную сопротивляемость древесины сосны при сжатии",
    "details": "Защита 28.05.57. Дисс. к.т.н. / Ин-т строительной механики АН УССР. – Киев, 1956. – 188 с."
  },
  {
    "name": "КРЫШКО Евгений Прокофьевич",
    "title": "Динамика системы связанных асимметричных тел постоянной и переменной масс",
    "details": "Защита 31.05.94. Дисс. к.ф.-м.н. 01.02.01 / Днепропетровский ин-т инженеров железнодорожного транспорта. Министерство транспорта Украины. – Днепропетровск, 1993. – 153 с."
  },
  {
    "name": "КРЮКОВ Николай Николаевич",
    "title": "Напряженнное состояние оболочек вращщения средней толщины",
    "details": "Защита 19.05.70. Дисс. к.ф.-м.н. / Ин-т механики АН УССР. – Киев,1970. – 151 с."
  },
  {
    "name": "КРЮКОВ Николай Николаевич",
    "title": "Численное решение задач о напряженно-деформированном состоянии гибких тонкостенных элементов конструкций",
    "details": "Защита 1986 г. Дисс. д.т.н. / Ин-т механики АН УССР. – Киев, 1986. – 466 с."
  },
  {
    "name": "КУБЕНКО В.Д.",
    "title": "Некоторые динамические задачи концентрации напряжений около отвертстий",
    "details": "Защита 04.01.66. Дисс. к.ф.-м.н. / Ин-т механики АН УССР.– Киев,1965.– 167 с."
  },
  {
    "name": "КУЗНЕЦОВ Ю.Н.",
    "title": "Стержень равного сопротивления продольнопоперечному изгибу",
    "details": "Защита 28.05.57. Дисс. к.т.н. / Ин-т строительной механики АН УССР. – Киев, 1956. – 148 с."
  },
  {
    "name": "КУЗЬМА Александр Всеволодович",
    "title": "Взаимодействие сферических тел в цилиндрической полости с несжимаемой жидкостью при вибрации",
    "details": "Защита 1990 г. Дисс. к.ф.-м.н. 01.02.05., 01.02.01 / Ин-т механики АН УССР. – Киев, 1990. – 128 с."
  },
  {
    "name": "КУЗЬМА В.М.",
    "title": "О динамической неустойчивости упругих систем со случайно изменяющимися параметрами",
    "details": "Защита 29.06.65. Дисс. к.ф.-м.н. / Ин-т механики АН УССР. – Киев,1965. – 152 с."
  },
  {
    "name": "КУРЧАКОВ Евгений Евгеньевич",
    "title": "Исследование связи деформаций и напряжений для нелинейного анизотропного тела",
    "details": "Защита 1982 г. Дисс. к.т.н. / Ин-т механики АН УССР. - Киев, 1982. – 134 с."
  },
  {
    "name": "КУРЧАКОВ Евгений Евгеньевич",
    "title": "Построение и экспериментальное обоснование уравнений состояния для нелинейного анизотропного тела",
    "details": "Защита 26.05.87. Дисс. к.ф.-м.н. 01.02.04 / Ин-т механики АН УССР. – Киев, 1987. – 130 с."
  },
  {
    "name": "КУЮН А.И.",
    "title": "Метод комплексного исследования тепловых явлений в поверхностных слоях металла при трении и износе, резании и шлифовании",
    "details": "Защита 19.10.54. Дисс. к.т.н. / Ин-т строительной механики АН УССР. – Киев, 1954. – 132 с."
  },
  {
    "name": "КУЮН А.И.",
    "title": "Тепловые явления в поверхностных слоях металла при трении и износе и шлифовании",
    "details": "Защита 19.12.1960. Дисс. к.т.н. / Ин-т механики АН УССР. – Киев,1960."
  }
] as const;
