export const defendedDissertationsO = [
  {
    "name": "ОБОЛЕНСКИЙ Анатолий Юрьевич",
    "title": "Критерии устойчивости решений некоторых нелинейных систем",
    "details": "Защита 13.01.81. Дисс. к.ф.-м.н. 01.02.01 / Ин-т механики АН УССР. – Киев, 1980. – 115 с."
  },
  {
    "name": "ОБУХОВ Владимир Васильевич",
    "title": "Исследование закономерностей деформирования армированных пластиков при высоких температурах",
    "details": "Защита 1982 г. Дисс. к.т.н. 01.02.04 / Ин-т механики АН УССР. – Киев, 1982. – 173 с."
  },
  {
    "name": "ОВСЯННИКОВ А.С.",
    "title": "Решение плоской задачи теории упругости для полулинейного материала",
    "details": "Защита 24.04.73. Дисс. к.ф.-м.н. / Ин-т механики АН УССР.– Киев, 1972. – 137 с."
  },
  {
    "name": "ОБІЗЮК Наталія Іванівна",
    "title": "Осесиметричні коливання і дисипативний розігрів шаруватих електров’язкопружних тіл обертання",
    "details": "Захист 25.01.94. Дис. к.ф.-м.н. 01.02.04 / Ін-т механіки НАН України. – Київ, 1993. – 151 с."
  },
  {
    "name": "ОЗЕРОВ В.И.",
    "title": "Исследование анизотропной вязкоупругости ориентированных стеклопластиков и цилиндрических оболочек из них",
    "details": "Защита 21.03.67. Дисс. к.т.н. / Ин-т механики АН УССР. – Киев, 1966. – 156 с."
  },
  {
    "name": "ОЛЕЙНИК Александр Семенович",
    "title": "Разработка модели и оценка ползучести при статическом и циклическом нагружениях методом изохрон",
    "details": "Защита 26.01.88. Дисс. к.т.н. 01.02.04 / Ин-т механики АН УССР. – Киев, 1987. – 144 с."
  },
  {
    "name": "ОМЕЦИНСКАЯ Е.Б.",
    "title": "Коротковолновые динамические процессы в цилиндрической оболочке, несущей жидкость",
    "details": "Защита 22.09.70. Дисс. к.ф.-м.н. / Ин-т механики АН УССР.– Киев, 1970. – 144 с."
  },
  {
    "name": "ОЧЕРЕТНЮК Евгений Владимирович",
    "title": "Задачи динамики абсолютно твердого тела на струнном подвесе с переменными параметрами",
    "details": "Защита 03.06.2014 г. Дисс. к.ф.-м.н. 01.02.01 / Ин-т механики им. С.П.Тимошенко НАН Украины. – Киев, 2014. – 133 с."
  }
] as const;
