export const defendedDissertationsB = [
  {
    "name": "БАБАЕВ Арташес Эдуардович",
    "title": "Исследование нестационарных нагрузок при действии внутренних волновых источников",
    "details": "Защита 22.10.74. Дисс. к.ф.-м.н. / Ин-т механики АН УССР. – Киев, 1974. – 124 с."
  },
  {
    "name": "БАБАЕВ Арташес Эдуардович",
    "title": "Нестационарные волны в сплошных средах с системой отражающих поверхностей",
    "details": "Защита 22.12.87. Дис. д.т.н. 01.02.04 / Ин-т механики АН УССР. – Киев, 1987. – 352 с."
  },
  {
    "name": "БАБАЕВ М.А.",
    "title": "Влияние физической нелинейности на концентрацию напряжений возле свободных и подкрепленных отверстий",
    "details": "Защита 15.11.66. Дисс. к.ф.-м.н. / Ин-т механики АН УССР. – Киев, 1966. – 119 с."
  },
  {
    "name": "БАБАЕВ Мирбаба Султан оглы",
    "title": "Устойчивость ряда волокон в упругой матрице",
    "details": "Защита 18.03.86. Дисс. к.ф.-м.н. 01.02.04 / Ин-т механики АН УССР. – Киев, 1986. – 139 с."
  },
  {
    "name": "БАБАЕВ Олександр Арташесович",
    "title": "Нестаціонарні режими роботи п'єзовипромінювачів з врахуванням процесів в кабельному тракті",
    "details": "Захист 31.10.2000 р. Дис. к.ф.-м.н. 01.02.04 / Ін-т механіки НАН України. – Київ, 2000. – 140 с."
  },
  {
    "name": "БАБЕНКО Владимир Иванович",
    "title": "Локальная устойчивость выпуклых упругих оболочек",
    "details": "Защита 28.05.91. Дисс. д.ф.-м.н. 01.02.04 / Физико-технический институт низких температур АН Украины. – Харьков, 1991. – 407 с."
  },
  {
    "name": "БАБЕНКО Сергей Витальевич",
    "title": "Устойчивость движения непрерывно-дискретных крупномасштабных механических систем при структурных возмущениях",
    "details": "Защита 27.12.2011 г. Дис. к.ф.-м.н. 01.02.01 / Ин-т механики НАН України. – Киев, 2011. – 160 с."
  },
  {
    "name": "БАБЕШКО М.Е.",
    "title": "Термопластическое напряженное состояние коротких цилиндров с учетом истории нагружения",
    "details": "Защита 16.09.75. Дисс. к.ф.-м.н. / Ин-т механики АН УССР. – Киев, 1975. – 170 с."
  },
  {
    "name": "БАБИЧ Дмитрий Васильевич",
    "title": "Некоторые динамические задачи теории пластин и оболочек с несимметричным тензором напряжений",
    "details": "Защита 16.04.68. Дисс. к.ф.-м.н. / Ин-т механики АН УССР. – Киев, 1967. – 161 с."
  },
  {
    "name": "БАБИЧ Дмитрий Васильевич",
    "title": "Устойчивость и собственные колебания оболочек вращения с неоднородными геометрическими и механическими параметрами",
    "details": "Защита 1996 г. Дисс. д.т.н. 05.02.07 / Ин-т механики НАН Украины. – Киев, 1996. – 289 с."
  },
  {
    "name": "БАБИЧ И.Ю.",
    "title": "Исследование устойчивости цилиндрических оболочек при помощи трехмерных линеаризированных уравнений для малых докритических деформаций",
    "details": "Защита 06.05.69. Дисс. к.ф.-м.н. / Ин-т механики АН УССР. – Киев, 1969. – 150 с."
  },
  {
    "name": "БАБИЧ И.Ю.",
    "title": "Трехмерные задачи устойчивости композитных материалов и элементов конструкций из них",
    "details": "Защита 08.10.74. Дисс. д. ф.-м.н. / Ин-т механики АН УССР. – Киев, 1974. – 278 с."
  },
  {
    "name": "БАБИЧ Степан Юрьевич",
    "title": "Исследование распространения поверхностных волн в предварительно напряженных телах с криволинейными границами",
    "details": "Защита 30.11.76. Дисс. к.ф.-м.н. / Ин-т механики АН УССР. – Киев, 1976. – 124 с."
  },
  {
    "name": "БАБИЧ Степан Юрьевич",
    "title": "Контактные задачи для упругих тел с начальными напряжениями",
    "details": "Защита 27.10.87. Дисс. д.т.н. 01.02.04 / Ин-т механики АН УССР. – Киев, 1987. – 285 с."
  },
  {
    "name": "БАГНО Александр Михайлович",
    "title": "Исследование закономерности распространения волн в предварительно напряженном цилиндре с жидкостью",
    "details": "Защита 23.12.80. Дисс. к.ф.-м.н. 01.02.01 / Ин-т механики АН УССР. – Киев, 1980. – 141 с."
  },
  {
    "name": "БАГНО Александр Михайлович",
    "title": "Распространение упругих волн в предварительно напряженных телах, взаимодействующих с вязкой сжимаемой жидкостью",
    "details": "Защита 1995 г. Дисс. д.ф.-м.н. 01.02.04 / Ин-т механики НАН Украины. – Киев, 1995. – 438 с."
  },
  {
    "name": "БАКЛАНОВА Галина Николаевна",
    "title": "Упруго-пластические линеаризированные задачи устойчивости горных выработок",
    "details": "Защита 23.12.80. Дисс. к.ф.-м.н. 01.02.04 / Ин-т механики АН УССР. – Киев, 1980. – 105 л."
  },
  {
    "name": "БАМБУРА Ольга Василівна",
    "title": "Біфуркації та стійкість станів рівноваги систем послідовно з'єднаних маятників під дією слідкуючої сили",
    "details": "Захист 26.02.2008 р. Дис. к.ф.-м.н. 01.02.01 / Київ, 2007. – 138 с."
  },
  {
    "name": "БАНЯС Мирон Володимирович",
    "title": "Неізотермічне деформування фізично нелінійних циліндричних тіл, що ростуть із врахуванням мікроструктурних перетворень",
    "details": "Захист 28.02.2012 р. Дис. к.ф.-м.н. 01.02.04 / Київ, 2011. – 120 с."
  },
  {
    "name": "БАРСУК Р.П.",
    "title": "Продольные колебания системы цилиндрических оболочек, соединенных внутренними односторонними связями",
    "details": "Защита 31.10.72. Дисс. к.ф.-м.н. / Ин-т механики АН УССР. – Киев, 1971. – 135 с."
  },
  {
    "name": "БАСТУН Владимир Николаевич",
    "title": "Исследование упруго-пластческих свойств анзотропной стали при плоском напряженном состоянии",
    "details": "Защита 04.07.67. Дисс. к.т.н. / Ин-т механики АН УССР. – Киев, 1966. – 190 с."
  },
  {
    "name": "БАСТУН Владимир Николаевич",
    "title": "Оценка напряженно-деформированного состояния элементов констукций на основе анализа деформационного материала",
    "details": "Защита 26.06.90. Дис. д.т.н. 01.02.04 / Ин-т механики АН УССР. – Киев, 1989. – 339 с."
  },
  {
    "name": "БАШ В.Я.",
    "title": "Исследовани деформаций и напряжений термоэлектрическим методом",
    "details": "Защита 26.02.74. Дисс. к.т.н. / Ин-т механики АН УССР. – Киев, 1973. – 158 с."
  },
  {
    "name": "БЕГМУРАТОВ Кудратилла Алиевич",
    "title": "Иерархические матричные функции Ляпунова и их применение в задачах устойчивости динамических систем",
    "details": "Защита 30.11.93. Дисс. к.ф.-м.н. 01.02.01 / Ин-т механики АН Украины. – Киев, 1993. – 106 с."
  },
  {
    "name": "БЕЗВЕРХИЙ Александр Игоревич",
    "title": "Динамика протяженных гдрофизческих систем с упругими связями",
    "details": "Защита 28.04.82. Дисс. к.ф.-м.н. 01.02.04; 01.02.05 / Ин-т механики АН Украины. – Киев,1992. – 140 с."
  },
  {
    "name": "БЕЗВЕРХИЙ Олександр Ігорович",
    "title": "Динаміка гнучких континуально-дискретних розгалужених структур при взаємодії з зовнішнім середовищем",
    "details": "Захист 29.11.2005 р. Дис. д.ф.-м.н. 01.02.04. / Ін-т механіки АН України. – Київ, 2005. – 275 с."
  },
  {
    "name": "БЕЛЕВЦОВА Наталья Леонидовна",
    "title": "Неосесимметричное упруго-пластическое напряженное состояние оболочек вращения при простых неизотермических процессах нагружения с учетом истории их протекания",
    "details": "Защита 1982. Дисс. к.т.н. 01.02.03 / Ин-т механики АН УССР. – Киев, 1982."
  },
  {
    "name": "БЕЛОВА Марина Александровна",
    "title": "Критические состояние тонких упругих оболочек при простом и сложном вращниях",
    "details": "Защита 21.12.2004 г. Дисс. к.ф.-м.н. 01.02.04 / Национальный транспортный ун-т. – Киев, 2004. – 182 с."
  },
  {
    "name": "БЕРГУЛЕВ Антон Сергеевич",
    "title": "Определение напряженного состояния прямоугольных анизотропных пластин в пространственной постановке",
    "details": "Защита 25.09.12. Дисс. к.ф.-м.н. 01.02.04 / Ин-т механики им.С.П. Тимошенко НАН Украины. – Киев, 2012. – 147 с."
  },
  {
    "name": "БЕСПАЛОВА Елена Ивановна",
    "title": "Напряженное состояние тонких оболочек и пластин, ограниченных дугами координатных линий",
    "details": "Защита 05.11.69. Дисс. к.ф.-м.н. / Ин-т механики АН УССР. – Киев,1969. – 165 с."
  },
  {
    "name": "БЕСПАЛОВА Елена Ивановна",
    "title": "Решение стационарных задач теории упругости и теории оболочек методом полных систем",
    "details": "Защита 1995. Дис. д.ф.-м.н. 01.02.04 / Ин-т механики НАН Украины. – Киев, 1995. – 311 с."
  },
  {
    "name": "БИРЮКОВИЧ Ю.Л.",
    "title": "Прочность и деформативность стеклоцемента",
    "details": "Защита 07.05.63. Дисс. к.т.н. / Ин-т механики АН УССР. – Киев,1962. – 183 с."
  },
  {
    "name": "БЛАГОВЕЩЕНСКИЙ Ю.В.",
    "title": "Расчет стержней и пластинок переменного ечения на изгиб, устойчивость и колебания",
    "details": "Защита 30.12.96. Дисс. к.т.н. / Ин-т строительной механики АН УССР. – Киев, 1996. – 102 с."
  },
  {
    "name": "БЛОШКО Николай Михайлович",
    "title": "Осесимметричное напряженное состояние упругих цилиндров конечных размеров с окружными выточками",
    "details": "Защита 29.05.84. Дисс. к.т.н. 01.02.04 / Ин-т механики АН УССР. – Киев, 1984. – 163 с."
  },
  {
    "name": "БОБЫРЬ Валентин Иванович",
    "title": "Термоупругопластическое состояние тел вращения при неосесимметричных процессах нагружения по траекториям малой кривизны",
    "details": "Защита 29.03.88. Дисс. к.ф.-м.н. 01.02.04 / Ин-т механики АН УССР. – Киев, 1988. – 99 с."
  },
  {
    "name": "БОГАТЫРЧУК Анатолий Степанович",
    "title": "Напряженное состояние композитных оболочек с двумя круговыми отверстиями",
    "details": "Защита 25.12.90. Дис. к.ф.-м.н. 01.02.04 / Ин-т механики АН УССР. – Kиев, 1990. – 100 с."
  },
  {
    "name": "БОГДАНОВ Вячеслав Леонидович",
    "title": "Пространственная неосесимметричная задача механики разрушения материалов при сжатии вдоль приповерхностной дискообразной трещины",
    "details": "Защита 29.09.92. Дис. к.ф.-м.н. 01.02.04 / Ин-т механики НАН Украины. – Киев,1992. – 112 с."
  },
  {
    "name": "БОГДАНОВ Вячеслав Леонідович",
    "title": "Об'єднаний аналіз задач механіки руйнування матеріалів з початковими напруженнями та руйнування тіл при стисканні вздовж тріщин",
    "details": "Захист 17.03.2009 г. Дис. д.ф.-м.н. 01.02.04 / Ін-т механіки ім. С.П.Тимошенка НАН України. – Київ, 2008. – 324 с."
  },
  {
    "name": "БОЙЧУК Олена Володимирівна",
    "title": "Зв'язані динамічні задачі термомеханіки для фізичного нелінійного циліндра при нестаціонарному термічному навантаженні",
    "details": "Захист 27.04.2010 р. Дис. к.ф.- м.н. 01.02.04 / Ін-т механіки ім. С.П.Тимошенка НАН України. – Київ, 2010. – 144 с."
  },
  {
    "name": "БОЛКИСЕВ Александр Михайлович",
    "title": "Вынужденные колебания вязкоупругого пьезокерамического полого цилиндра",
    "details": "Защита 10.06.86. Дис. к.ф.-м.н. 01.02.04. / Ин-т механики АН УССР. – Kиев, 1986. – 138 с."
  },
  {
    "name": "БОНДАРЕНКО А.А.",
    "title": "Рассеяние энергии при колебаниях механических систем, содержащих упругие связи из пласмасс",
    "details": "Защита 13.11.62. Дисс. к.т.н. / Ин-т механики АН УССР. – Kиев, 1962. – 154 с."
  },
  {
    "name": "БОНДАРЕНКО А.А.",
    "title": "Затухание колебаний в деталях машин из пластмасс",
    "details": "Защита 07.04.70. Дисс. к.т.н. / Ин-т механики АН УССР. – Kиев, 1970. – 176 с."
  },
  {
    "name": "БОРИСЕЙКО Олександр Віталійович",
    "title": "Стійкість циліндричних та конічних оболонок з композитів з непружними компонентами",
    "details": "Захист 11.06.96. Дис. к.ф.-м.н. 01.02.04. / Ін-т механіки НАН України. – Kиїв, 1996. – 130 с."
  },
  {
    "name": "БОРИСЕНКО В.А.",
    "title": "Связанные электроупругие колебания пьезокерамических сферических оболочек",
    "details": "Защита 19.10.76. Дисс. к.ф.-м.н. / Ин-т механики АН УССР. – Kиев, 1976. – 166 с."
  },
  {
    "name": "БОРИСЕНКО, В.И.",
    "title": "Динамическая устойчивость круговой цилиндрической оболочки при продольном ударе",
    "details": "Защита 25.01.66. Дисс. к.ф.-м.н. / Ин-т механики АН УССР. – Kиев,1965. – 178 с."
  },
  {
    "name": "БОРИСОВ Евген Миколайович",
    "title": "Тривимірні фізично нелінійні задачі про згин пружних прямокутних пластин",
    "details": "Захист 28.01.2003 р. Дис. к.ф.-м.н. 01.02.04. / Ін-т механіки НАН України. – Kиїв, 2002. – 136 с."
  },
  {
    "name": "БОРИСЮК А.И.",
    "title": "Упруго-пластическое напряженное состояние оболочек вращения при осесимметричном неравномерном нагреве",
    "details": "Защита 19.11.68. Дисс. к.т.н. / Ин-т механики АН УССР. – Kиев, 1968. – 131 с."
  },
  {
    "name": "БОРОДАЧЕВ Александр Николаевич",
    "title": "Задачи механики разрушения для тела с плоской эллиптической трещиной при произвольных условиях нагружения",
    "details": "Защита 22.12.81. Дисс. к.ф.-м.н. 01.02.04 / Ин-т механики АН УССР. – Киев, 1981. – 133 с."
  },
  {
    "name": "БОРОДЕНКО Юрий Николаевич",
    "title": "Армоупругое состояние цилиндрической оболочки, взаимодействующей с твёрдым телом при неидеальном контакте",
    "details": "Защита 1992 г. Дисс. к.ф.-м.н. 01.02.04 / Ин-т механики НАН Украины. – Киев, 1992. – 139 с."
  },
  {
    "name": "БОРУК Ігор Георгійович",
    "title": "Впив слідкуючої, дисипативних та пружних сил на динамічну поведінку багатоланкового маятника",
    "details": "Захист 30.05.2000 р. Дис. к.ф.-м.н. 01.02.01 / Ін-т механіки НАН України. – Kиїв, 2000. – 182 с."
  },
  {
    "name": "БОРЩ Юрий Александрович",
    "title": "Краевые задачи плоской теории упругости для секреторных тел",
    "details": "Защита 1981 г. Дисс. к.ф.-м.н. 01.02.04 / Ин-т механики АН УССР. – Киев, 1981. – 261 с."
  },
  {
    "name": "БОЯРШИНА Любовь Григорьевна",
    "title": "Нелинейные пространственные колебания управляемых тел с жидкостью в условиях резонансов",
    "details": "Защита 1982 г. Дисс. к.ф.-м.н. 01.02.01 / Ин-т механики АН УССР. – Киев, 1982. – 140 с."
  },
  {
    "name": "БРАЙКОВСКАЯ Надежда Сергеевна",
    "title": "Исследование закономерностей неупругого деформирования металлов при неизотермических активных процессах нагружения по произвольным плоским траекториям",
    "details": "Защита 30.12.86. Дисс. к.т.н. 01.02.04 / Ин-т механики АН УССР. – Киев, 1986, - 153 с."
  },
  {
    "name": "БЫХОВЕЦ Ольга Николаевна",
    "title": "Напряженное состояние некруговых цилиндрических оболочек в уточненной постановке",
    "details": "Защита 15.11.83. Дисс. к.ф.-м.н. 01.02.04 / Ин-т механики АН УССР. – Киев, 1983. – 142 с."
  }
] as const;
