export const defendedDissertationsB = [
  {
    "name": "БАБАЕВ Арташес Эдуардович",
    "title": "Исследование нестационарных нагрузок при действии внутренних волновых источников",
    "details": "Защита 22.10.74. Дисс. к.ф.-м.н. / Ин-т механики АН УССР. – Киев, 1974. – 124 с."
  },
  {
    "name": "БАБАЕВ Арташес Эдуардович",
    "title": "Нестационарные волны в сплошных средах с системой отражающих поверхностей",
    "details": "Защита 22.12.87. Дис. д.т.н. 01.02.04 / Ин-т механики АН УССР. – Киев, 1987. – 352 с."
  },
  {
    "name": "БАБАЕВ М.А.",
    "title": "Влияние физической нелинейности на концентрацию напряжений возле свободных и подкрепленных отверстий",
    "details": "Защита 15.11.66. Дисс. к.ф.-м.н. / Ин-т механики АН УССР. – Киев, 1966. – 119 с."
  },
  {
    "name": "БАБАЕВ Мирбаба Султан оглы",
    "title": "Устойчивость ряда волокон в упругой матрице",
    "details": "Защита 18.03.86. Дисс. к.ф.-м.н. 01.02.04 / Ин-т механики АН УССР. – Киев, 1986. – 139 с."
  },
  {
    "name": "БАБАЕВ Олександр Арташесович",
    "title": "Нестаціонарні режими роботи п'єзовипромінювачів з врахуванням процесів в кабельному тракті",
    "details": "Захист 31.10.2000 р. Дис. к.ф.-м.н. 01.02.04 / Ін-т механіки НАН України. – Київ, 2000. – 140 с."
  },
  {
    "name": "БАБЕНКО Владимир Иванович",
    "title": "Локальная устойчивость выпуклых упругих оболочек",
    "details": "Защита 28.05.91. Дисс. д.ф.-м.н. 01.02.04 / Физико-технический институт низких температур АН Украины. – Харьков, 1991. – 407 с."
  },
  {
    "name": "БАБЕНКО Сергей Витальевич",
    "title": "Устойчивость движения непрерывно-дискретных крупномасштабных механических систем при структурных возмущениях",
    "details": "Защита 27.12.2011 г. Дис. к.ф.-м.н. 01.02.01 / Ин-т механики НАН України. – Киев, 2011. – 160 с."
  },
  {
    "name": "БАБЕШКО М.Е.",
    "title": "Термопластическое напряженное состояние коротких цилиндров с учетом истории нагружения",
    "details": "Защита 16.09.75. Дисс. к.ф.-м.н. / Ин-т механики АН УССР. – Киев, 1975. – 170 с."
  },
  {
    "name": "БАБИЧ Дмитрий Васильевич",
    "title": "Некоторые динамические задачи теории пластин и оболочек с несимметричным тензором напряжений",
    "details": "Защита 16.04.68. Дисс. к.ф.-м.н. / Ин-т механики АН УССР. – Киев, 1967. – 161 с."
  },
  {
    "name": "БАБИЧ Дмитрий Васильевич",
    "title": "Устойчивость и собственные колебания оболочек вращения с неоднородными геометрическими и механическими параметрами",
    "details": "Защита 1996 г. Дисс. д.т.н. 05.02.07 / Ин-т механики НАН Украины. – Киев, 1996. – 289 с."
  },
  {
    "name": "БАБИЧ И.Ю.",
    "title": "Исследование устойчивости цилиндрических оболочек при помощи трехмерных линеаризированных уравнений для малых докритических деформаций",
    "details": "Защита 06.05.69. Дисс. к.ф.-м.н. / Ин-т механики АН УССР. – Киев, 1969. – 150 с."
  },
  {
    "name": "БАБИЧ И.Ю.",
    "title": "Трехмерные задачи устойчивости композитных материалов и элементов конструкций из них",
    "details": "Защита 08.10.74. Дисс. д. ф.-м.н. / Ин-т механики АН УССР. – Киев, 1974. – 278 с."
  },
  {
    "name": "БАБИЧ Степан Юрьевич",
    "title": "Исследование распространения поверхностных волн в предварительно напряженных телах с криволинейными границами",
    "details": "Защита 30.11.76. Дисс. к.ф.-м.н. / Ин-т механики АН УССР. – Киев, 1976. – 124 с."
  },
  {
    "name": "БАБИЧ Степан Юрьевич",
    "title": "Контактные задачи для упругих тел с начальными напряжениями",
    "details": "Защита 27.10.87. Дисс. д.т.н. 01.02.04 / Ин-т механики АН УССР. – Киев, 1987. – 285 с."
  },
  {
    "name": "БАГНО Александр Михайлович",
    "title": "Исследование закономерности распространения волн в предварительно напряженном цилиндре с жидкостью",
    "details": "Защита 23.12.80. Дисс. к.ф.-м.н. 01.02.01 / Ин-т механики АН УССР. – Киев, 1980. – 141 с."
  },
  {
    "name": "БАГНО Александр Михайлович",
    "title": "Распространение упругих волн в предварительно напряженных телах, взаимодействующих с вязкой сжимаемой жидкостью",
    "details": "Защита 1995 г. Дисс. д.ф.-м.н. 01.02.04 / Ин-т механики НАН Украины. – Киев, 1995. – 438 с."
  },
  {
    "name": "БАКЛАНОВА Галина Николаевна",
    "title": "Упруго-пластические линеаризированные задачи устойчивости горных выработок",
    "details": "Защита 23.12.80. Дисс. к.ф.-м.н. 01.02.04 / Ин-т механики АН УССР. – Киев, 1980. – 105 л."
  },
  {
    "name": "БАМБУРА Ольга Василівна",
    "title": "Біфуркації та стійкість станів рівноваги систем послідовно з'єднаних маятників під дією слідкуючої сили",
    "details": "Захист 26.02.2008 р. Дис. к.ф.-м.н. 01.02.01 / Київ, 2007. – 138 с."
  },
  {
    "name": "БАНЯС Мирон Володимирович",
    "title": "Неізотермічне деформування фізично нелінійних циліндричних тіл, що ростуть із врахуванням мікроструктурних перетворень",
    "details": "Захист 28.02.2012 р. Дис. к.ф.-м.н. 01.02.04 / Київ, 2011. – 120 с."
  },
  {
    "name": "БАРСУК Р.П.",
    "title": "Продольные колебания системы цилиндрических оболочек, соединенных внутренними односторонними связями",
    "details": "Защита 31.10.72. Дисс. к.ф.-м.н. / Ин-т механики АН УССР. – Киев, 1971. – 135 с."
  }
] as const;
