export const defendedDissertationsF = [
  {
    "name": "ФЕЛЬДМАН А.А.",
    "title": "Устойчивость кольцевой пластинки со свободным внутренним краем при равномерном внешнем давлении",
    "details": "Защита 07.12.48. Дисс. к.т.н. / Ин-т строительной механики АН УССР. – Киев, 1948. – 165 с."
  },
  {
    "name": "ФЕРНАТІ Павло Вікторович",
    "title": "Нелінійна повзучість в’язкопружних односпрямованих волокнистих композитів та їх компонентів за умов розтягу",
    "details": "Захист 28.02.2006 р. Дис. к.т.н. 01.02.04 / Ін-т механіки ім. С.П.Тимошенка НАН України. – Київ, 2005. – 163 с."
  },
  {
    "name": "ФИАЛКО Сергей Юрьевич",
    "title": "Исследование влияния начальних несовершенств на собственные частоты колебаний ребристих конических оболочек",
    "details": "Защита 1982 г. Дисс. д.т.н. / Ин-т механики АН УССР. – Киев, 1982. – 157 с."
  },
  {
    "name": "ФИЛАТОВ М.Я.",
    "title": "Сопротивление усталости металлов в святи с формой цикла нагружения",
    "details": "Защита 04.03.69. Дисс. к.т.н. / Ин-т механики АН УССР. – Киев, 1968. – 210 с."
  },
  {
    "name": "ФИЛАТОВ Э.Я.",
    "title": "Исследование эксплуатационной нагруженности и оценка долговечности рам тракторов",
    "details": "Защита 05.02.63. Дисс. к.т.н. / Ин-т механики АН УССР. – Киев, 1962. – 168 с."
  },
  {
    "name": "ФИЛИППОВ М.Я.",
    "title": "Применение обобщенных методов Вольтерра и Адамара к решению нестационарных задач волновой динамики",
    "details": "Защита 05.03.68. Дисс. д.т.н. / Ин-т механики АН УССР. – Киев, 1966. – 349 с."
  },
  {
    "name": "ФІЛІМОНІХІНА Ірина Іванівна",
    "title": "Умови зменшення кута нутації обертового несучого тіла в ізольованій системі",
    "details": "Захист 30.03.2010 р. Дис. к.ф.-м.н. 01.02.01 / Кіровоградський національний технічний ун-т Міністерства освіти і науки України. – Кіровоград, 2009. – 127 с."
  },
  {
    "name": "ФИЛИМОНИХИН Геннадий Борисович",
    "title": "Динамика и устойчивость маятниковых автобалансиров со связями, наложенными на движения маятников",
    "details": "Защита 26.11.91. Дисс. к.ф.-м.н. 01.02.01 / КГУ им. Т.Г.Шевченко. – Киев, 1991. – 142 с."
  }
] as const;
