export const defendedDissertationsYa = [
  {
    "name": "ЯКИМЕНКО Наталия Николаевна",
    "title": "Связанные задачи термовязкоупругости для плоских тел с концентраторами напряжений при гармоническом нагружении",
    "details": "Защита 21.06.2005 г. Дисс. к.ф.-м.н. 01.02.04 / Ин-т механіки им. С.П.Тимошенко НАН Украины. – Киев, 2005. – 108 с."
  },
  {
    "name": "ЯКИМЕНКО Сергей Николаевич",
    "title": "Термонапряженное состояние вязкоупругих тел вращения при циклическом во времени нагружении",
    "details": "Защита 1989 г. Дисс. к.ф.-м.н. 01.02.04 / Ин-т механики АН УССР. – Киев, 1989. – 163 с."
  },
  {
    "name": "Яковенко Ніна Дмитрівна.",
    "title": "Динамічні задачі для циліндричних тіл з непружних матеріалів з мікроструктурними перетвореннями при імпульсному термомеханічному навантаженні. : Кандидат фізико-математичних наук : спец.. 01.02.04 - Механіка деформівного твердого тіла : дата захисту 2018-10-30; . Інститут механіки ім. С.П. Тимошенка НАНУ. – Київ, 0418U003589.",
    "details": ""
  },
  {
    "name": "ЯКОВЕНКО Олена Валеріївна",
    "title": "Динамічна взаємодія ударних хвиль з поверхнею розділу трансверсально-ізотропних пружних середовищ",
    "details": "Захист 31.10.2000 р. Дис. к.ф.-м.н. 01.02.04 / Ін-т механіки ім. С.П.Тимошенка НАН України. – Київ, 2000. – 266 с."
  },
  {
    "name": "ЯКОВЛЕВА Олена Сергіївна",
    "title": "Крайові ефекти в шаруватих композитах з розривним наповнювачем",
    "details": "Захист 1993 р. Дис. к.ф.-м.н. 01.02.04 / Ін-т механіки НАН України. – Київ, 1993. – 116 с."
  },
  {
    "name": "ЯМПОЛЬСКИЙ Л.С.",
    "title": "Расчет неразрезных многоколенчатых валов с учетом податливости опор",
    "details": "Защита 26.12.45. Дисс. к.т.н. / Ин-т строительной механики АН УССР. – Киев, 1945. – 138 с."
  },
  {
    "name": "ЯНКЕВИЧ В.Ф.",
    "title": "Структурные изменения металла при воздействии потока сжатых газов высокой температуры",
    "details": "Защита 26.04.60. Дисс. к.т.н. / Ин-т строительной механики АН УССР. – Киев, 1959. – 200 с."
  },
  {
    "name": "ЯРЕМЧЕНКО Наталія Петрівна",
    "title": "Визначення напруженого стану прямокутних в плані пологих ортотропних оболонок змінної товщини в уточненій постановці",
    "details": "Захист 17.03.2009 р. Дис. к.ф.-м.н. 01.02.04 / Ін-т механіки ім. С.П.Тимошенка НАН України. – Київ, 2008. – 129 с."
  },
  {
    "name": "ЯРЕМЧЕНКО Сергій Миколайович",
    "title": "Напружений стан ортотропних некругових циліндричних оболонок змінної товщини в уточненій постановці",
    "details": "Захист 31.01.2006 р. Дис. к.ф.-м.н. 01.02.04 / Ін-т механіки ім. С.П.Тимошенка НАН України. – Київ, 2005. – 147 с."
  },
  {
    "name": "Яремченко Сергій Миколайович.",
    "title": "Чисельний аналіз стаціонарного деформування циліндрів та куль неоднорідної структури на основі різних моделей : Доктор фізико-математичних наук : спец.. 01.02.04 - Механіка деформівного твердого тіла: дата захисту 2021-09-28; . Інститут механіки ім. С. П. Тимошенка Національної академії наук України. – Київ, 0521U101952 .",
    "details": ""
  },
  {
    "name": "ЯРЕЦЬКА Наталія Олександрівна",
    "title": "Тиск пружного циліндричного штампу на пружний шар з початковими (залишковими) напруженнями",
    "details": "Захист 10.02.2015 р. Дис. к.ф.-м.н. 01.02.04 / Хмельницький національний ун-т Міністерства освіти і науки України. – Хмельницький, 2014. – 141 с."
  },
  {
    "name": "ЯРИГІНА Наталія Олександрівна",
    "title": "Акустоелектричні хвилі в шаруватих циліндрах в акустичному середовищі",
    "details": "Захист 26.10.93. Дис. к.ф.-м.н. 01.02.04 / Ін-т механіки НАН України. – Київ, 1993. – 141 с."
  },
  {
    "name": "ЯРОШЕК А.Д.",
    "title": "Исследование внешних слоев деталей машин без разрушения методом вихревых потоков",
    "details": "Защита 28.02.62. Дисс. к.т.н. / Ин-т механики АН УССР. – Киев, 1960. – 177 с."
  },
  {
    "name": "ЯСИНСКИЙ Сергей Анатольевич",
    "title": "Метод балансного преобразования в задачах редукции динамическимх моделей машин",
    "details": "Защита 1994 г. Дисс. к.ф.-м.н. 01.02.01 / Ин-т механики НАН Украины. – Киев, 1994. – 140 с."
  },
  {
    "name": "ЯЦЕНКО В.Ф.",
    "title": "Предельная несущая способность и деформативность деревянных балок при изгибе",
    "details": "Защита 27.10.53. Дисс. к.т.н. / Ин-т строительной механики АН УССР. – Киев, 1953. – 192 с."
  },
  {
    "name": "ЯЦЕНКО В.Ф.",
    "title": "Прочность и ползучесть слоистых пластиков (сжатие, растяжение, изгиб)",
    "details": "Защита 05.03.63. Дисс. д.т.н. / Ин-т механики АН УССР. – Киев, 1962. – 484 с."
  }
] as const;
