export const defendedDissertationsSh = [
  {
    "name": "ШАЛДЫРВАН Валерий Анатольевич",
    "title": "Пространственные задачи теории упругости для многосвязных пластин с усложненными свойствами",
    "details": "Защита 1980 г. Дисс. д.ф.-м.н. 01.02.04 / Ин-т механики АН УССР. – Киев, 1980. – 312 с."
  },
  {
    "name": "ШАРАПОВ А.Д.",
    "title": "Исследование осесимметричной и антисимметричной деформации элементов осевых компрессоров",
    "details": "Защита 25.06.68. Дисс. к.т.н. / Ин-т механики АН УССР. – Киев, 1967. – 208 с."
  },
  {
    "name": "ШЕВЧЕНКО Александр Юрьевич",
    "title": "Исследование термонапряженного состояния составных цилиндров и пластин",
    "details": "Защита 30.09.80. Дисс. к.ф.-м.н. 01.02.04 / Ин-т механики АН УССР. – Киев, 1980. – 130 с."
  },
  {
    "name": "ШЕВЧЕНКО Светлана Николаевна",
    "title": "Напряженное состояние полых некруговых цилиндров",
    "details": "Защита 27.06.89. Дисс. к.ф.-м.н. 01.02.04 / Ин-т механики АН УССР. – Киев, 1989. – 121 с."
  },
  {
    "name": "ШЕВЧЕНКО Ю.Н.",
    "title": "Термопластичность при переменных нагружениях",
    "details": "Защита 19.11.68. Дисс. д.т.н. / Ин-т механики АН УССР. – Киев, 1968. – 494 с."
  },
  {
    "name": "ШЕВЧУК В.А.",
    "title": "Экспериментальное исследование физического состояния волнистого поверхностного слоя, полученного при механической обработке",
    "details": "Защита 27.10.53. Дисс. к.т.н. / Ин-т строительной механики АН УССР. – Киев, 1953. – 187 с.+ Приложение №1 и №2 147 с."
  },
  {
    "name": "ШЕГАЙ Вадим Валентинович",
    "title": "Применение матрицы Ляпунова в теории устойчивости движения",
    "details": "Защита 11.11.86. Дисс. к.ф.-м.н. 01.02.01 / Ин-т механики АН УССР. – Киев, 1986. – 141 с."
  },
  {
    "name": "ШИКУЛА Елена Николаевна",
    "title": "Исследование напряженного состояния в окрестности выработок в газонасыщенном пористом массиве при нестационарной фильтрации газа",
    "details": "Защита 10.12.85. Дисс. к.ф.-м.н. 01.02.04 / Ин-т механики АН УССР. – Киев, 1985. – 180 с."
  },
  {
    "name": "ШИКУЛА Елена Николаевна",
    "title": "Линейные и нелинейные эффективные деформативные свойства пористых композитних материалов",
    "details": "Защита 29.09.98. Дисс. д.ф.-м.н. 01.02.04 / Ин-т механики НАН Украины. – Киев, 1998. – 358 с."
  },
  {
    "name": "ШИШКИН П.Г.",
    "title": "Исследование механических свойств полимерного связующего с начальними усадочными деформациями",
    "details": "Защита 24.06.75. Дисс. к.т.н. / Ин-т механики АН УССР. – Киев, 1974. – 126 с."
  },
  {
    "name": "ШНЕРЕНКО К.И.",
    "title": "Некоторые задачи равновесия сферической оболочки с отверстиями",
    "details": "Защита 23.05.67. Дисс. к.ф.-м.н. / Ин-т механики АН УССР. – Киев, 1966. – 127 с."
  },
  {
    "name": "ШНЕРЕНКО К.И.",
    "title": "Напряженное состояние оболочек с отверстиями, изготовленных из композитных материалов",
    "details": "Защита 17.09.81. Дисс. д.ф.-м.н. 01.02.04 / Ин-т механики АН УССР. – Киев, 1981. – 299 с."
  },
  {
    "name": "ШПАК Владимир Анатольевич",
    "title": "Закономерности распространения и предельные свойства нормальных волн в анизотропном упругом слое",
    "details": "Защита 26.06.90. Дисс. к.ф.- м.н. 01.02.04 / Донецкий физико-технический ин-т АН УССР. – Донецк, 1990. – 151 с."
  },
  {
    "name": "ШТАНЦЕЛЬ Сергій Едуардович",
    "title": "Чисельне моделювання динамічної поведінки тришарових оболонок обертання з врахуванням дискретності наповнювача при нестаціонарних навантаженнях",
    "details": "Захист 10.06.2003 р. Дис. к.т.н. 01.02.04 / Ін-т механіки ім. С.П.Тимошенка НАН України. – Київ, 2003. – 158 с."
  },
  {
    "name": "Шугайло Олексій Петрович.",
    "title": "Напружено-деформований стан трубчатих елементів парогенераторів при аварійних ситуаціях : к.т.н. : спец.. 01.02.04 - Механіка деформівного твердого тіла : дата захисту 2019-09-24; . Інститут механіки ім.С.П.Тимошенка НАН України. – , 0419U001536.",
    "details": ""
  },
  {
    "name": "ШУЛЬГА Н.А.",
    "title": "Концентрация напряженого состояния около отверстий при изгибе физически нелинейных тонких плит",
    "details": "Защита 15.11.66. Дисс. к.ф.-м.н. / Ин-т механики АН УССР. – Киев, 1966. – 123 с."
  },
  {
    "name": "ШУЛЬГА Н.А.",
    "title": "Исследование динамических процессов в композиционных материалах и элементах конструкций из них",
    "details": "Защита 1979 г. Дисс. д.ф.-м.н. 01.02.04 / Ин-т механики АН УССР. – Киев, 1979. – 295 с."
  },
  {
    "name": "ШУЛЬГА Олександр Миколайович",
    "title": "Коливання неоднорідних стержнів періодичної структури",
    "details": "Захист 26.09.2000 р. Дис. к.ф.-м.н. 01.02.04 / Ін-т механіки НАН України. – Київ, 2000. – 140 с."
  },
  {
    "name": "ШУМАН Б.М.",
    "title": "Некоторые вопросы распространения упругих волн в среде со случайными неоднородностями",
    "details": "Защита 17.02.70. Дисс. к.ф.-м.н. / Ин-т механики АН УССР. – Киев, 1969. – 164 с."
  }
] as const;
