export const defendedDissertationsKh = [
  {
    "name": "ХАЗІН Генадій Анатолійович",
    "title": "Дослідження механічних моделей процесу передруйнування в умовах плоскої деформації",
    "details": "Захист 27.04.2004 р. Дис. к.ф.-м.н. 01.02.04 / Ін-т механіки ім. С.П.Тимошенка НАН України. – Київ, 2003. – 147 с."
  },
  {
    "name": "ХАМРЕНКО Юлія Анатоліївна",
    "title": "Нестаціонарні коливання тришарових оболонок обертання при осесиметричних навантаженнях",
    "details": "Захист 27.02.2001 р. Дис. к.ф.-м.н. 01.02.04 / Ін-т механіки ім. С.П.Тимошенка НАН України. – Київ, 2001. – 216 с."
  },
  {
    "name": "ХАРИТОНОВА Леся Василівна",
    "title": "Визначення критичних значень навантаження при деформуванні гнучких довгих пологих не кругових циліндричних оболонок для різних видів закріплення країв",
    "details": "Захист 26.01.2010 р. Дис. к.ф.-м.н. 01.02.04 / Ін-т механіки ім. С.П.Тимошенка НАН України. – Київ, 2009. – 189 с."
  },
  {
    "name": "ХИЖНЯК Владимир Константинович",
    "title": "Нелинейные задачи изгиба и колебаний гибких пластин постоянной и переменной толщины",
    "details": "Защита 17.02.87. Дисс. к.ф.-м.н. 01.02.04 / Ин-т механики АН УССР. – Киев, 1986. – 121 с."
  },
  {
    "name": "ХИТРОВ В.Н.",
    "title": "Напряженно-деформированное состояние оболочек, подкрепленных ребрами в двух направлениях",
    "details": "Защита 21.12.71. Дисс. к.т.н. / Ин-т механики АН УССР. – Киев, 1971. – 203 с."
  },
  {
    "name": "ХОЛОПОВА В.В.",
    "title": "Нелинейные колебания твердых тел с жидкостью в слабых и сильных гравитационных полях",
    "details": "Защита 31.01.78. Дисс. к.т.н. / Ин-т механики АН УССР. – Киев, 1977. – 156 с."
  },
  {
    "name": "ХОМА И.Ю.",
    "title": "Концентрация напряженного состояния вокруг отверстий в пологих оболочках в упруго-пластической стадии деформации",
    "details": "Защита 07.07.64. Дисс. к.ф.-м.н. / Ин-т механики АН УССР. – Киев, 1964. – 132 с."
  },
  {
    "name": "ХОМА Юрій Іванович",
    "title": "Осесиметрична задача механіки крихкого руйнування матеріалів з циліндричною тріщиною при осьовому стиску",
    "details": "Захист 26.12.95. Дис. к.ф.-м.н. 01.02.04 / Ін-т механіки НАН України. – Київ, 1995. – 138 с."
  },
  {
    "name": "ХОРОШУН Анатолий Сергеевич",
    "title": "Достаточные условия параметрической устойчивости квазилинейных механических систем",
    "details": "Защита 09.12.2008 г. Дисс. к.ф.-м.н. 01.02.01 / Ин-т механики им. С.П.Тимошенко НАН Украины. – Киев, 2008. – 130 с."
  },
  {
    "name": "ХОРОШУН Л.П.",
    "title": "Термодинамика и некоторые вопросы механики сплошных сред",
    "details": "Защита 23.04.634. Дисс. к.ф.-м.н. / Ин-т механики АН УССР. – Киев, 1962. – 118 с."
  },
  {
    "name": "ХОТЕНКО Олена Олександрівна",
    "title": "До теорії квадратично нелінійних хвиль Релея",
    "details": "Захист 25.03.2014 р. Дис. к.ф.-м.н. 01.02.04 / Ін-т механіки ім. С.П.Тимошенка НАН України. – Київ, 2014. – 191 с."
  },
  {
    "name": "ХОТЯИНЦЕВ Н.П.",
    "title": "Импульсный метод исследования динамических процессовв механических системах",
    "details": "Защита 25.12.51. Дисс. к.т.н. / Ин-т строительной механики АН УССР. – Киев, 1951. – 191 с."
  },
  {
    "name": "ХРЕБЕТ Валерий Григорович",
    "title": "Динамика маятниковых многозвенных систем с качением",
    "details": "Защита 1993 г. Дисс. к.ф.-м.н. 01.02.01 / Ин-т механики НАН Украины. – Киев, 1993. – 130 с."
  }
] as const;
