export const defendedDissertationsTs = [
  {
    "name": "ЦАПЕНКО А.С.",
    "title": "Динамика тел с полостями, содержащими жидкость и газ при вибрационных воздействиях",
    "details": "Защита 10.10.78. Дисс. д.ф.-м.н. / Ин-т механики АН УССР. – Киев, 1978. – 163 с."
  },
  {
    "name": "ЦИДЫЛО Иван Васильевич",
    "title": "Устойчивость маховичного накопителя энергии на транспортном средстве",
    "details": "Защита 22.12.87. Дисс. к.ф.-м.н. 01.02.01 / Ин-т механики АН УССР. – Киев, 1987. – 157 с."
  },
  {
    "name": "ЦОЙ Н.Г.",
    "title": "Свободные колебания систем перекрестных балок с учетом кручения",
    "details": "Защита 10.04.56. Дисс. к.т.н. / Ин-т строительной механики АН УССР. – Киев, 1955. – 214 с."
  },
  {
    "name": "ЦУРПАЛ И.А.",
    "title": "Концентрация напряжений около отверстий в физически нелинейных упругих пластинах",
    "details": "Защита 05.02.63. Дисс. к.ф.-м.н. / Ин-т механики АН УССР. – Киев, 1962. – 135 с."
  },
  {
    "name": "ЦУРПАЛ И.А.",
    "title": "Некоторые задачи концентрации напряжений около отверстий с учетом физической нелинейности материала",
    "details": "Защита 22.04.69. Дисс. д.т.н. / Ин-т механики АН УССР. – Киев, 1968. – 338 с."
  },
  {
    "name": "ЦУРПАЛ Світлана Іванівна",
    "title": "Поодинокі прості плоскі хвилі дзвіноподібної форми в композитивних матеріалах",
    "details": "Захист 24.12.96. Дис. к.ф.-м.н. 01.02.04 / Ін-т механіки НАН України. – Київ, 1996. – 136 с."
  },
  {
    "name": "ЦЫБУЛЬНИК Виталий Александрович",
    "title": "Решение двумерных задач статики конических оболочек переменной толщины на основе аппроксимации функций дискретными рядами Фурье",
    "details": "Защита 18.12.2007 г. Дисс. к.ф.-м.н. 01.02.04 / Ин-т механики им. С.П.Тимошенко НАН Украины. – Киев, 2007. – 149 с."
  }
] as const;
