export const defendedDissertationsYu = [
  {
    "name": "Юрчук Василь Миколайович.",
    "title": "Теорія поодиноких хвиль в нелінійно пружних матеріалах : к.ф.-м.н. : спец.. 01.02.04 - Механіка деформівного твердого тіла : дата захисту 2019-07-09; . Інститут механіки ім.С.П.Тимошенка НАН України. –, 0419U001493.",
    "details": ""
  },
  {
    "name": "Юрчук Василь Миколайович.",
    "title": "Cценарії поширення хвиль різних початкових профілів в матеріалах, які деформуються нелінійно пружно : Доктор фізико-математичних наук : спец.. 01.02.04 - Механіка деформівного твердого тіла : дата захисту 2025-09-02; . Інститут механіки ім. С. П. Тимошенка Національної академії наук України. – Київ, 0525U000311 .",
    "details": ""
  }
] as const;
